espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/spi_mem_s_reg.h
/** SPI_MEM_S_SRAM_CMD_REG register
 *  SPI0 external RAM mode control register
 */
#define SPI_MEM_S_SRAM_CMD_REG (DR_REG_PSRAM_MSPI0_BASE + 0x44)
/** SPI_MEM_S_SCLK_MODE : R/W; bitpos: [1:0]; default: 0;
 *  SPI clock mode bits. 0: SPI clock is off when CS inactive 1: SPI clock is delayed
 *  one cycle after CS inactive 2: SPI clock is delayed two cycles after CS inactive 3:
 *  SPI clock is always on.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SCLK_MODE    0x00000003U
#define SPI_MEM_S_SCLK_MODE_M  (SPI_MEM_S_SCLK_MODE_V << SPI_MEM_S_SCLK_MODE_S)
#define SPI_MEM_S_SCLK_MODE_V  0x00000003U
#define SPI_MEM_S_SCLK_MODE_S  0
/** SPI_MEM_S_SWB_MODE : R/W; bitpos: [9:2]; default: 0;
 *  Mode bits in the external RAM fast read mode  it is combined with
 *  spi_mem_fastrd_mode bit.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SWB_MODE    0x000000FFU
#define SPI_MEM_S_SWB_MODE_M  (SPI_MEM_S_SWB_MODE_V << SPI_MEM_S_SWB_MODE_S)
#define SPI_MEM_S_SWB_MODE_V  0x000000FFU
#define SPI_MEM_S_SWB_MODE_S  2
/** SPI_MEM_S_SDIN_DUAL : R/W; bitpos: [10]; default: 0;
 *  For SPI0 external RAM , din phase apply 2 signals. 1: enable 0: disable. The bit is
 *  the same with spi_mem_usr_sram_dio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SDIN_DUAL    (BIT(10))
#define SPI_MEM_S_SDIN_DUAL_M  (SPI_MEM_S_SDIN_DUAL_V << SPI_MEM_S_SDIN_DUAL_S)
#define SPI_MEM_S_SDIN_DUAL_V  0x00000001U
#define SPI_MEM_S_SDIN_DUAL_S  10
/** SPI_MEM_S_SDOUT_DUAL : R/W; bitpos: [11]; default: 0;
 *  For SPI0 external RAM , dout phase apply 2 signals. 1: enable 0: disable. The bit
 *  is the same with spi_mem_usr_sram_dio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SDOUT_DUAL    (BIT(11))
#define SPI_MEM_S_SDOUT_DUAL_M  (SPI_MEM_S_SDOUT_DUAL_V << SPI_MEM_S_SDOUT_DUAL_S)
#define SPI_MEM_S_SDOUT_DUAL_V  0x00000001U
#define SPI_MEM_S_SDOUT_DUAL_S  11
/** SPI_MEM_S_SADDR_DUAL : R/W; bitpos: [12]; default: 0;
 *  For SPI0 external RAM , address phase apply 2 signals. 1: enable 0: disable. The
 *  bit is the same with spi_mem_usr_sram_dio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SADDR_DUAL    (BIT(12))
#define SPI_MEM_S_SADDR_DUAL_M  (SPI_MEM_S_SADDR_DUAL_V << SPI_MEM_S_SADDR_DUAL_S)
#define SPI_MEM_S_SADDR_DUAL_V  0x00000001U
#define SPI_MEM_S_SADDR_DUAL_S  12
/** SPI_MEM_S_SDIN_QUAD : R/W; bitpos: [14]; default: 0;
 *  For SPI0 external RAM , din phase apply 4 signals. 1: enable 0: disable. The bit is
 *  the same with spi_mem_usr_sram_qio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SDIN_QUAD    (BIT(14))
#define SPI_MEM_S_SDIN_QUAD_M  (SPI_MEM_S_SDIN_QUAD_V << SPI_MEM_S_SDIN_QUAD_S)
#define SPI_MEM_S_SDIN_QUAD_V  0x00000001U
#define SPI_MEM_S_SDIN_QUAD_S  14
/** SPI_MEM_S_SDOUT_QUAD : R/W; bitpos: [15]; default: 0;
 *  For SPI0 external RAM , dout phase apply 4 signals. 1: enable 0: disable. The bit
 *  is the same with spi_mem_usr_sram_qio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SDOUT_QUAD    (BIT(15))
#define SPI_MEM_S_SDOUT_QUAD_M  (SPI_MEM_S_SDOUT_QUAD_V << SPI_MEM_S_SDOUT_QUAD_S)
#define SPI_MEM_S_SDOUT_QUAD_V  0x00000001U
#define SPI_MEM_S_SDOUT_QUAD_S  15
/** SPI_MEM_S_SADDR_QUAD : R/W; bitpos: [16]; default: 0;
 *  For SPI0 external RAM , address phase apply 4 signals. 1: enable 0: disable. The
 *  bit is the same with spi_mem_usr_sram_qio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SADDR_QUAD    (BIT(16))
#define SPI_MEM_S_SADDR_QUAD_M  (SPI_MEM_S_SADDR_QUAD_V << SPI_MEM_S_SADDR_QUAD_S)
#define SPI_MEM_S_SADDR_QUAD_V  0x00000001U
#define SPI_MEM_S_SADDR_QUAD_S  16
/** SPI_MEM_S_SCMD_QUAD : R/W; bitpos: [17]; default: 0;
 *  For SPI0 external RAM , cmd phase apply 4 signals. 1: enable 0: disable. The bit is
 *  the same with spi_mem_usr_sram_qio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SCMD_QUAD    (BIT(17))
#define SPI_MEM_S_SCMD_QUAD_M  (SPI_MEM_S_SCMD_QUAD_V << SPI_MEM_S_SCMD_QUAD_S)
#define SPI_MEM_S_SCMD_QUAD_V  0x00000001U
#define SPI_MEM_S_SCMD_QUAD_S  17
/** SPI_MEM_S_SDIN_OCT : R/W; bitpos: [18]; default: 0;
 *  For SPI0 external RAM , din phase apply 8 signals. 1: enable 0: disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SDIN_OCT    (BIT(18))
#define SPI_MEM_S_SDIN_OCT_M  (SPI_MEM_S_SDIN_OCT_V << SPI_MEM_S_SDIN_OCT_S)
#define SPI_MEM_S_SDIN_OCT_V  0x00000001U
#define SPI_MEM_S_SDIN_OCT_S  18
/** SPI_MEM_S_SDOUT_OCT : R/W; bitpos: [19]; default: 0;
 *  For SPI0 external RAM , dout phase apply 8 signals. 1: enable 0: disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SDOUT_OCT    (BIT(19))
#define SPI_MEM_S_SDOUT_OCT_M  (SPI_MEM_S_SDOUT_OCT_V << SPI_MEM_S_SDOUT_OCT_S)
#define SPI_MEM_S_SDOUT_OCT_V  0x00000001U
#define SPI_MEM_S_SDOUT_OCT_S  19
/** SPI_MEM_S_SADDR_OCT : R/W; bitpos: [20]; default: 0;
 *  For SPI0 external RAM , address phase apply 4 signals. 1: enable 0: disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SADDR_OCT    (BIT(20))
#define SPI_MEM_S_SADDR_OCT_M  (SPI_MEM_S_SADDR_OCT_V << SPI_MEM_S_SADDR_OCT_S)
#define SPI_MEM_S_SADDR_OCT_V  0x00000001U
#define SPI_MEM_S_SADDR_OCT_S  20
/** SPI_MEM_S_SCMD_OCT : R/W; bitpos: [21]; default: 0;
 *  For SPI0 external RAM , cmd phase apply 8 signals. 1: enable 0: disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SCMD_OCT    (BIT(21))
#define SPI_MEM_S_SCMD_OCT_M  (SPI_MEM_S_SCMD_OCT_V << SPI_MEM_S_SCMD_OCT_S)
#define SPI_MEM_S_SCMD_OCT_V  0x00000001U
#define SPI_MEM_S_SCMD_OCT_S  21
/** SPI_MEM_S_SDUMMY_RIN : R/W; bitpos: [22]; default: 1;
 *  In the dummy phase of a MSPI read data transfer when accesses to external RAM, the
 *  signal level of SPI bus is output by the MSPI controller.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SDUMMY_RIN    (BIT(22))
#define SPI_MEM_S_SDUMMY_RIN_M  (SPI_MEM_S_SDUMMY_RIN_V << SPI_MEM_S_SDUMMY_RIN_S)
#define SPI_MEM_S_SDUMMY_RIN_V  0x00000001U
#define SPI_MEM_S_SDUMMY_RIN_S  22
/** SPI_MEM_S_SDUMMY_WOUT : R/W; bitpos: [23]; default: 1;
 *  In the dummy phase of a MSPI write data transfer when accesses to external RAM, the
 *  signal level of SPI bus is output by the MSPI controller.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SDUMMY_WOUT    (BIT(23))
#define SPI_MEM_S_SDUMMY_WOUT_M  (SPI_MEM_S_SDUMMY_WOUT_V << SPI_MEM_S_SDUMMY_WOUT_S)
#define SPI_MEM_S_SDUMMY_WOUT_V  0x00000001U
#define SPI_MEM_S_SDUMMY_WOUT_S  23
/** SPI_MEM_S_SMEM_WDUMMY_DQS_ALWAYS_OUT : R/W; bitpos: [24]; default: 0;
 *  In the dummy phase of an MSPI write data transfer when accesses to external RAM,
 *  the level of SPI_DQS is output by the MSPI controller.
 */
#define SPI_MEM_S_SMEM_WDUMMY_DQS_ALWAYS_OUT    (BIT(24))
#define SPI_MEM_S_SMEM_WDUMMY_DQS_ALWAYS_OUT_M  (SPI_MEM_S_SMEM_WDUMMY_DQS_ALWAYS_OUT_V << SPI_MEM_S_SMEM_WDUMMY_DQS_ALWAYS_OUT_S)
#define SPI_MEM_S_SMEM_WDUMMY_DQS_ALWAYS_OUT_V  0x00000001U
#define SPI_MEM_S_SMEM_WDUMMY_DQS_ALWAYS_OUT_S  24
/** SPI_MEM_S_SMEM_WDUMMY_ALWAYS_OUT : R/W; bitpos: [25]; default: 0;
 *  In the dummy phase of an MSPI write data transfer when accesses to external RAM,
 *  the level of SPI_IO[7:0] is output by the MSPI controller.
 */
#define SPI_MEM_S_SMEM_WDUMMY_ALWAYS_OUT    (BIT(25))
#define SPI_MEM_S_SMEM_WDUMMY_ALWAYS_OUT_M  (SPI_MEM_S_SMEM_WDUMMY_ALWAYS_OUT_V << SPI_MEM_S_SMEM_WDUMMY_ALWAYS_OUT_S)
#define SPI_MEM_S_SMEM_WDUMMY_ALWAYS_OUT_V  0x00000001U
#define SPI_MEM_S_SMEM_WDUMMY_ALWAYS_OUT_S  25
/** SPI_MEM_S_SDIN_HEX : R/W; bitpos: [26]; default: 0;
 *  For SPI0 external RAM , din phase apply 16 signals. 1: enable 0: disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SDIN_HEX    (BIT(26))
#define SPI_MEM_S_SDIN_HEX_M  (SPI_MEM_S_SDIN_HEX_V << SPI_MEM_S_SDIN_HEX_S)
#define SPI_MEM_S_SDIN_HEX_V  0x00000001U
#define SPI_MEM_S_SDIN_HEX_S  26
/** SPI_MEM_S_SDOUT_HEX : R/W; bitpos: [27]; default: 0;
 *  For SPI0 external RAM , dout phase apply 16 signals. 1: enable 0: disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SDOUT_HEX    (BIT(27))
#define SPI_MEM_S_SDOUT_HEX_M  (SPI_MEM_S_SDOUT_HEX_V << SPI_MEM_S_SDOUT_HEX_S)
#define SPI_MEM_S_SDOUT_HEX_V  0x00000001U
#define SPI_MEM_S_SDOUT_HEX_S  27
/** SPI_MEM_S_SMEM_DQS_IE_ALWAYS_ON : R/W; bitpos: [30]; default: 0;
 *  When accesses to external RAM, 1: the IE signals of pads connected to SPI_DQS are
 *  always 1. 0: Others.
 */
#define SPI_MEM_S_SMEM_DQS_IE_ALWAYS_ON    (BIT(30))
#define SPI_MEM_S_SMEM_DQS_IE_ALWAYS_ON_M  (SPI_MEM_S_SMEM_DQS_IE_ALWAYS_ON_V << SPI_MEM_S_SMEM_DQS_IE_ALWAYS_ON_S)
#define SPI_MEM_S_SMEM_DQS_IE_ALWAYS_ON_V  0x00000001U
#define SPI_MEM_S_SMEM_DQS_IE_ALWAYS_ON_S  30
/** SPI_MEM_S_SMEM_DATA_IE_ALWAYS_ON : R/W; bitpos: [31]; default: 1;
 *  When accesses to external RAM, 1: the IE signals of pads connected to SPI_IO[7:0]
 *  are always 1. 0: Others.
 */
#define SPI_MEM_S_SMEM_DATA_IE_ALWAYS_ON    (BIT(31))
#define SPI_MEM_S_SMEM_DATA_IE_ALWAYS_ON_M  (SPI_MEM_S_SMEM_DATA_IE_ALWAYS_ON_V << SPI_MEM_S_SMEM_DATA_IE_ALWAYS_ON_S)
#define SPI_MEM_S_SMEM_DATA_IE_ALWAYS_ON_V  0x00000001U
#define SPI_MEM_S_SMEM_DATA_IE_ALWAYS_ON_S  31

/** SPI_MEM_S_SRAM_DRD_CMD_REG register
 *  SPI0 external RAM DDR read command control register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define SPI_MEM_S_SRAM_DRD_CMD_REG (DR_REG_PSRAM_MSPI0_BASE + 0x48)
/** SPI_MEM_S_CACHE_SRAM_USR_RD_CMD_VALUE : R/W; bitpos: [15:0]; default: 0;
 *  For SPI0,When cache mode is enable it is the read command value of command phase
 *  for sram.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_CACHE_SRAM_USR_RD_CMD_VALUE    0x0000FFFFU
#define SPI_MEM_S_CACHE_SRAM_USR_RD_CMD_VALUE_M  (SPI_MEM_S_CACHE_SRAM_USR_RD_CMD_VALUE_V << SPI_MEM_S_CACHE_SRAM_USR_RD_CMD_VALUE_S)
#define SPI_MEM_S_CACHE_SRAM_USR_RD_CMD_VALUE_V  0x0000FFFFU
#define SPI_MEM_S_CACHE_SRAM_USR_RD_CMD_VALUE_S  0
/** SPI_MEM_S_CACHE_SRAM_USR_RD_CMD_BITLEN : R/W; bitpos: [31:28]; default: 0;
 *  For SPI0,When cache mode is enable it is the length in bits of command phase for
 *  sram. The register value shall be (bit_num-1).
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_CACHE_SRAM_USR_RD_CMD_BITLEN    0x0000000FU
#define SPI_MEM_S_CACHE_SRAM_USR_RD_CMD_BITLEN_M  (SPI_MEM_S_CACHE_SRAM_USR_RD_CMD_BITLEN_V << SPI_MEM_S_CACHE_SRAM_USR_RD_CMD_BITLEN_S)
#define SPI_MEM_S_CACHE_SRAM_USR_RD_CMD_BITLEN_V  0x0000000FU
#define SPI_MEM_S_CACHE_SRAM_USR_RD_CMD_BITLEN_S  28

