espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/spi_mem_s_reg.h
/** SPI_MEM_S_SRAM_DWR_CMD_REG register
 *  SPI0 external RAM DDR write command control register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define SPI_MEM_S_SRAM_DWR_CMD_REG (DR_REG_PSRAM_MSPI0_BASE + 0x4c)
/** SPI_MEM_S_CACHE_SRAM_USR_WR_CMD_VALUE : R/W; bitpos: [15:0]; default: 0;
 *  For SPI0,When cache mode is enable it is the write command value of command phase
 *  for sram.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_CACHE_SRAM_USR_WR_CMD_VALUE    0x0000FFFFU
#define SPI_MEM_S_CACHE_SRAM_USR_WR_CMD_VALUE_M  (SPI_MEM_S_CACHE_SRAM_USR_WR_CMD_VALUE_V << SPI_MEM_S_CACHE_SRAM_USR_WR_CMD_VALUE_S)
#define SPI_MEM_S_CACHE_SRAM_USR_WR_CMD_VALUE_V  0x0000FFFFU
#define SPI_MEM_S_CACHE_SRAM_USR_WR_CMD_VALUE_S  0
/** SPI_MEM_S_CACHE_SRAM_USR_WR_CMD_BITLEN : R/W; bitpos: [31:28]; default: 0;
 *  For SPI0,When cache mode is enable it is the in bits of command phase  for sram.
 *  The register value shall be (bit_num-1).
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_CACHE_SRAM_USR_WR_CMD_BITLEN    0x0000000FU
#define SPI_MEM_S_CACHE_SRAM_USR_WR_CMD_BITLEN_M  (SPI_MEM_S_CACHE_SRAM_USR_WR_CMD_BITLEN_V << SPI_MEM_S_CACHE_SRAM_USR_WR_CMD_BITLEN_S)
#define SPI_MEM_S_CACHE_SRAM_USR_WR_CMD_BITLEN_V  0x0000000FU
#define SPI_MEM_S_CACHE_SRAM_USR_WR_CMD_BITLEN_S  28

/** SPI_MEM_S_SRAM_CLK_REG register
 *  SPI0 external RAM clock control register
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define SPI_MEM_S_SRAM_CLK_REG (DR_REG_PSRAM_MSPI0_BASE + 0x50)
/** SPI_MEM_S_SCLKCNT_L : R/W; bitpos: [7:0]; default: 3;
 *  For SPI0 external RAM  interface, it must be equal to SPI_MEM_S_SCLKCNT_N.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SCLKCNT_L    0x000000FFU
#define SPI_MEM_S_SCLKCNT_L_M  (SPI_MEM_S_SCLKCNT_L_V << SPI_MEM_S_SCLKCNT_L_S)
#define SPI_MEM_S_SCLKCNT_L_V  0x000000FFU
#define SPI_MEM_S_SCLKCNT_L_S  0
/** SPI_MEM_S_SCLKCNT_H : R/W; bitpos: [15:8]; default: 1;
 *  For SPI0 external RAM  interface, it must be floor((SPI_MEM_S_SCLKCNT_N+1)/2-1).
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SCLKCNT_H    0x000000FFU
#define SPI_MEM_S_SCLKCNT_H_M  (SPI_MEM_S_SCLKCNT_H_V << SPI_MEM_S_SCLKCNT_H_S)
#define SPI_MEM_S_SCLKCNT_H_V  0x000000FFU
#define SPI_MEM_S_SCLKCNT_H_S  8
/** SPI_MEM_S_SCLKCNT_N : R/W; bitpos: [23:16]; default: 3;
 *  For SPI0 external RAM  interface, it is the divider of spi_mem_clk. So spi_mem_clk
 *  frequency is system/(SPI_MEM_S_SCLKCNT_N+1)
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SCLKCNT_N    0x000000FFU
#define SPI_MEM_S_SCLKCNT_N_M  (SPI_MEM_S_SCLKCNT_N_V << SPI_MEM_S_SCLKCNT_N_S)
#define SPI_MEM_S_SCLKCNT_N_V  0x000000FFU
#define SPI_MEM_S_SCLKCNT_N_S  16
/** SPI_MEM_S_SCLK_EQU_SYSCLK : R/W; bitpos: [31]; default: 0;
 *  For SPI0 external RAM  interface, 1: spi_mem_clk is equal to system 0: spi_mem_clk
 *  is divided from system clock.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_SCLK_EQU_SYSCLK    (BIT(31))
#define SPI_MEM_S_SCLK_EQU_SYSCLK_M  (SPI_MEM_S_SCLK_EQU_SYSCLK_V << SPI_MEM_S_SCLK_EQU_SYSCLK_S)
#define SPI_MEM_S_SCLK_EQU_SYSCLK_V  0x00000001U
#define SPI_MEM_S_SCLK_EQU_SYSCLK_S  31

/** SPI_MEM_S_FSM_REG register
 *  SPI0 FSM status register
 */
#define SPI_MEM_S_FSM_REG (DR_REG_PSRAM_MSPI0_BASE + 0x54)
/** SPI_MEM_S_LOCK_DELAY_TIME : R/W; bitpos: [18:7]; default: 4;
 *  The lock delay time of SPI0/1 arbiter by spi0_slv_st, after PER is sent by SPI1.
 */
#define SPI_MEM_S_LOCK_DELAY_TIME    0x00000FFFU
#define SPI_MEM_S_LOCK_DELAY_TIME_M  (SPI_MEM_S_LOCK_DELAY_TIME_V << SPI_MEM_S_LOCK_DELAY_TIME_S)
#define SPI_MEM_S_LOCK_DELAY_TIME_V  0x00000FFFU
#define SPI_MEM_S_LOCK_DELAY_TIME_S  7

/** SPI_MEM_S_INT_ENA_REG register
 *  SPI0 interrupt enable register
 */
#define SPI_MEM_S_INT_ENA_REG (DR_REG_PSRAM_MSPI0_BASE + 0xc0)
/** SPI_MEM_S_SLV_ST_END_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The enable bit for SPI_MEM_S_SLV_ST_END_INT interrupt.
 */
#define SPI_MEM_S_SLV_ST_END_INT_ENA    (BIT(3))
#define SPI_MEM_S_SLV_ST_END_INT_ENA_M  (SPI_MEM_S_SLV_ST_END_INT_ENA_V << SPI_MEM_S_SLV_ST_END_INT_ENA_S)
#define SPI_MEM_S_SLV_ST_END_INT_ENA_V  0x00000001U
#define SPI_MEM_S_SLV_ST_END_INT_ENA_S  3
/** SPI_MEM_S_MST_ST_END_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The enable bit for SPI_MEM_S_MST_ST_END_INT interrupt.
 */
#define SPI_MEM_S_MST_ST_END_INT_ENA    (BIT(4))
#define SPI_MEM_S_MST_ST_END_INT_ENA_M  (SPI_MEM_S_MST_ST_END_INT_ENA_V << SPI_MEM_S_MST_ST_END_INT_ENA_S)
#define SPI_MEM_S_MST_ST_END_INT_ENA_V  0x00000001U
#define SPI_MEM_S_MST_ST_END_INT_ENA_S  4
/** SPI_MEM_S_ECC_ERR_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The enable bit for SPI_MEM_S_ECC_ERR_INT interrupt.
 */
#define SPI_MEM_S_ECC_ERR_INT_ENA    (BIT(5))
#define SPI_MEM_S_ECC_ERR_INT_ENA_M  (SPI_MEM_S_ECC_ERR_INT_ENA_V << SPI_MEM_S_ECC_ERR_INT_ENA_S)
#define SPI_MEM_S_ECC_ERR_INT_ENA_V  0x00000001U
#define SPI_MEM_S_ECC_ERR_INT_ENA_S  5
/** SPI_MEM_S_PMS_REJECT_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The enable bit for SPI_MEM_S_PMS_REJECT_INT interrupt.
 */
#define SPI_MEM_S_PMS_REJECT_INT_ENA    (BIT(6))
#define SPI_MEM_S_PMS_REJECT_INT_ENA_M  (SPI_MEM_S_PMS_REJECT_INT_ENA_V << SPI_MEM_S_PMS_REJECT_INT_ENA_S)
#define SPI_MEM_S_PMS_REJECT_INT_ENA_V  0x00000001U
#define SPI_MEM_S_PMS_REJECT_INT_ENA_S  6
/** SPI_MEM_S_AXI_RADDR_ERR_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The enable bit for SPI_MEM_S_AXI_RADDR_ERR_INT interrupt.
 */
#define SPI_MEM_S_AXI_RADDR_ERR_INT_ENA    (BIT(7))
#define SPI_MEM_S_AXI_RADDR_ERR_INT_ENA_M  (SPI_MEM_S_AXI_RADDR_ERR_INT_ENA_V << SPI_MEM_S_AXI_RADDR_ERR_INT_ENA_S)
#define SPI_MEM_S_AXI_RADDR_ERR_INT_ENA_V  0x00000001U
#define SPI_MEM_S_AXI_RADDR_ERR_INT_ENA_S  7
/** SPI_MEM_S_AXI_WR_FLASH_ERR_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The enable bit for SPI_MEM_S_AXI_WR_FALSH_ERR_INT interrupt.
 */
#define SPI_MEM_S_AXI_WR_FLASH_ERR_INT_ENA    (BIT(8))
#define SPI_MEM_S_AXI_WR_FLASH_ERR_INT_ENA_M  (SPI_MEM_S_AXI_WR_FLASH_ERR_INT_ENA_V << SPI_MEM_S_AXI_WR_FLASH_ERR_INT_ENA_S)
#define SPI_MEM_S_AXI_WR_FLASH_ERR_INT_ENA_V  0x00000001U
#define SPI_MEM_S_AXI_WR_FLASH_ERR_INT_ENA_S  8
/** SPI_MEM_S_AXI_WADDR_ERR_INT__ENA : R/W; bitpos: [9]; default: 0;
 *  The enable bit for SPI_MEM_S_AXI_WADDR_ERR_INT interrupt.
 */
#define SPI_MEM_S_AXI_WADDR_ERR_INT__ENA    (BIT(9))
#define SPI_MEM_S_AXI_WADDR_ERR_INT__ENA_M  (SPI_MEM_S_AXI_WADDR_ERR_INT__ENA_V << SPI_MEM_S_AXI_WADDR_ERR_INT__ENA_S)
#define SPI_MEM_S_AXI_WADDR_ERR_INT__ENA_V  0x00000001U
#define SPI_MEM_S_AXI_WADDR_ERR_INT__ENA_S  9
/** SPI_MEM_S_RX_TRANS_OVF_INT_ENA : R/W; bitpos: [26]; default: 0;
 *  The enable bit for SPI_MEM_S_RX_TRANS_OVF_INT interrupt.
 */
#define SPI_MEM_S_RX_TRANS_OVF_INT_ENA    (BIT(26))
#define SPI_MEM_S_RX_TRANS_OVF_INT_ENA_M  (SPI_MEM_S_RX_TRANS_OVF_INT_ENA_V << SPI_MEM_S_RX_TRANS_OVF_INT_ENA_S)
#define SPI_MEM_S_RX_TRANS_OVF_INT_ENA_V  0x00000001U
#define SPI_MEM_S_RX_TRANS_OVF_INT_ENA_S  26
/** SPI_MEM_S_TX_TRANS_UDF_INT_ENA : R/W; bitpos: [27]; default: 0;
 *  The enable bit for SPI_MEM_S_TX_TRANS_UDF_INT interrupt.
 */
#define SPI_MEM_S_TX_TRANS_UDF_INT_ENA    (BIT(27))
#define SPI_MEM_S_TX_TRANS_UDF_INT_ENA_M  (SPI_MEM_S_TX_TRANS_UDF_INT_ENA_V << SPI_MEM_S_TX_TRANS_UDF_INT_ENA_S)
#define SPI_MEM_S_TX_TRANS_UDF_INT_ENA_V  0x00000001U
#define SPI_MEM_S_TX_TRANS_UDF_INT_ENA_S  27
/** SPI_MEM_S_DQS0_AFIFO_OVF_INT_ENA : R/W; bitpos: [28]; default: 0;
 *  The enable bit for SPI_MEM_S_DQS0_AFIFO_OVF_INT interrupt.
 */
#define SPI_MEM_S_DQS0_AFIFO_OVF_INT_ENA    (BIT(28))
#define SPI_MEM_S_DQS0_AFIFO_OVF_INT_ENA_M  (SPI_MEM_S_DQS0_AFIFO_OVF_INT_ENA_V << SPI_MEM_S_DQS0_AFIFO_OVF_INT_ENA_S)
#define SPI_MEM_S_DQS0_AFIFO_OVF_INT_ENA_V  0x00000001U
#define SPI_MEM_S_DQS0_AFIFO_OVF_INT_ENA_S  28
/** SPI_MEM_S_DQS1_AFIFO_OVF_INT_ENA : R/W; bitpos: [29]; default: 0;
 *  The enable bit for SPI_MEM_S_DQS1_AFIFO_OVF_INT interrupt.
 */
#define SPI_MEM_S_DQS1_AFIFO_OVF_INT_ENA    (BIT(29))
#define SPI_MEM_S_DQS1_AFIFO_OVF_INT_ENA_M  (SPI_MEM_S_DQS1_AFIFO_OVF_INT_ENA_V << SPI_MEM_S_DQS1_AFIFO_OVF_INT_ENA_S)
#define SPI_MEM_S_DQS1_AFIFO_OVF_INT_ENA_V  0x00000001U
#define SPI_MEM_S_DQS1_AFIFO_OVF_INT_ENA_S  29
/** SPI_MEM_S_BUS_FIFO1_UDF_INT_ENA : R/W; bitpos: [30]; default: 0;
 *  The enable bit for SPI_MEM_S_BUS_FIFO1_UDF_INT interrupt.
 */
#define SPI_MEM_S_BUS_FIFO1_UDF_INT_ENA    (BIT(30))
#define SPI_MEM_S_BUS_FIFO1_UDF_INT_ENA_M  (SPI_MEM_S_BUS_FIFO1_UDF_INT_ENA_V << SPI_MEM_S_BUS_FIFO1_UDF_INT_ENA_S)
#define SPI_MEM_S_BUS_FIFO1_UDF_INT_ENA_V  0x00000001U
#define SPI_MEM_S_BUS_FIFO1_UDF_INT_ENA_S  30
/** SPI_MEM_S_BUS_FIFO0_UDF_INT_ENA : R/W; bitpos: [31]; default: 0;
 *  The enable bit for SPI_MEM_S_BUS_FIFO0_UDF_INT interrupt.
 */
#define SPI_MEM_S_BUS_FIFO0_UDF_INT_ENA    (BIT(31))
#define SPI_MEM_S_BUS_FIFO0_UDF_INT_ENA_M  (SPI_MEM_S_BUS_FIFO0_UDF_INT_ENA_V << SPI_MEM_S_BUS_FIFO0_UDF_INT_ENA_S)
#define SPI_MEM_S_BUS_FIFO0_UDF_INT_ENA_V  0x00000001U
#define SPI_MEM_S_BUS_FIFO0_UDF_INT_ENA_S  31

/** SPI_MEM_S_INT_CLR_REG register
 *  SPI0 interrupt clear register
 */
#define SPI_MEM_S_INT_CLR_REG (DR_REG_PSRAM_MSPI0_BASE + 0xc4)
/** SPI_MEM_S_SLV_ST_END_INT_CLR : WT; bitpos: [3]; default: 0;
 *  The clear bit for SPI_MEM_S_SLV_ST_END_INT interrupt.
 */
#define SPI_MEM_S_SLV_ST_END_INT_CLR    (BIT(3))
#define SPI_MEM_S_SLV_ST_END_INT_CLR_M  (SPI_MEM_S_SLV_ST_END_INT_CLR_V << SPI_MEM_S_SLV_ST_END_INT_CLR_S)
#define SPI_MEM_S_SLV_ST_END_INT_CLR_V  0x00000001U
#define SPI_MEM_S_SLV_ST_END_INT_CLR_S  3
/** SPI_MEM_S_MST_ST_END_INT_CLR : WT; bitpos: [4]; default: 0;
 *  The clear bit for SPI_MEM_S_MST_ST_END_INT interrupt.
 */
#define SPI_MEM_S_MST_ST_END_INT_CLR    (BIT(4))
#define SPI_MEM_S_MST_ST_END_INT_CLR_M  (SPI_MEM_S_MST_ST_END_INT_CLR_V << SPI_MEM_S_MST_ST_END_INT_CLR_S)
#define SPI_MEM_S_MST_ST_END_INT_CLR_V  0x00000001U
#define SPI_MEM_S_MST_ST_END_INT_CLR_S  4
/** SPI_MEM_S_ECC_ERR_INT_CLR : WT; bitpos: [5]; default: 0;
 *  The clear bit for SPI_MEM_S_ECC_ERR_INT interrupt.
 */
#define SPI_MEM_S_ECC_ERR_INT_CLR    (BIT(5))
#define SPI_MEM_S_ECC_ERR_INT_CLR_M  (SPI_MEM_S_ECC_ERR_INT_CLR_V << SPI_MEM_S_ECC_ERR_INT_CLR_S)
#define SPI_MEM_S_ECC_ERR_INT_CLR_V  0x00000001U
#define SPI_MEM_S_ECC_ERR_INT_CLR_S  5
/** SPI_MEM_S_PMS_REJECT_INT_CLR : WT; bitpos: [6]; default: 0;
 *  The clear bit for SPI_MEM_S_PMS_REJECT_INT interrupt.
 */
#define SPI_MEM_S_PMS_REJECT_INT_CLR    (BIT(6))
#define SPI_MEM_S_PMS_REJECT_INT_CLR_M  (SPI_MEM_S_PMS_REJECT_INT_CLR_V << SPI_MEM_S_PMS_REJECT_INT_CLR_S)
#define SPI_MEM_S_PMS_REJECT_INT_CLR_V  0x00000001U
#define SPI_MEM_S_PMS_REJECT_INT_CLR_S  6
/** SPI_MEM_S_AXI_RADDR_ERR_INT_CLR : WT; bitpos: [7]; default: 0;
 *  The clear bit for SPI_MEM_S_AXI_RADDR_ERR_INT interrupt.
 */
#define SPI_MEM_S_AXI_RADDR_ERR_INT_CLR    (BIT(7))
#define SPI_MEM_S_AXI_RADDR_ERR_INT_CLR_M  (SPI_MEM_S_AXI_RADDR_ERR_INT_CLR_V << SPI_MEM_S_AXI_RADDR_ERR_INT_CLR_S)
#define SPI_MEM_S_AXI_RADDR_ERR_INT_CLR_V  0x00000001U
#define SPI_MEM_S_AXI_RADDR_ERR_INT_CLR_S  7
/** SPI_MEM_S_AXI_WR_FLASH_ERR_INT_CLR : WT; bitpos: [8]; default: 0;
 *  The clear bit for SPI_MEM_S_AXI_WR_FALSH_ERR_INT interrupt.
 */
#define SPI_MEM_S_AXI_WR_FLASH_ERR_INT_CLR    (BIT(8))
#define SPI_MEM_S_AXI_WR_FLASH_ERR_INT_CLR_M  (SPI_MEM_S_AXI_WR_FLASH_ERR_INT_CLR_V << SPI_MEM_S_AXI_WR_FLASH_ERR_INT_CLR_S)
#define SPI_MEM_S_AXI_WR_FLASH_ERR_INT_CLR_V  0x00000001U
#define SPI_MEM_S_AXI_WR_FLASH_ERR_INT_CLR_S  8
/** SPI_MEM_S_AXI_WADDR_ERR_INT_CLR : WT; bitpos: [9]; default: 0;
 *  The clear bit for SPI_MEM_S_AXI_WADDR_ERR_INT interrupt.
 */
#define SPI_MEM_S_AXI_WADDR_ERR_INT_CLR    (BIT(9))
#define SPI_MEM_S_AXI_WADDR_ERR_INT_CLR_M  (SPI_MEM_S_AXI_WADDR_ERR_INT_CLR_V << SPI_MEM_S_AXI_WADDR_ERR_INT_CLR_S)
#define SPI_MEM_S_AXI_WADDR_ERR_INT_CLR_V  0x00000001U
#define SPI_MEM_S_AXI_WADDR_ERR_INT_CLR_S  9
/** SPI_MEM_S_RX_TRANS_OVF_INT_CLR : WT; bitpos: [26]; default: 0;
 *  The clear bit for SPI_MEM_S_RX_TRANS_OVF_INT interrupt.
 */
#define SPI_MEM_S_RX_TRANS_OVF_INT_CLR    (BIT(26))
#define SPI_MEM_S_RX_TRANS_OVF_INT_CLR_M  (SPI_MEM_S_RX_TRANS_OVF_INT_CLR_V << SPI_MEM_S_RX_TRANS_OVF_INT_CLR_S)
#define SPI_MEM_S_RX_TRANS_OVF_INT_CLR_V  0x00000001U
#define SPI_MEM_S_RX_TRANS_OVF_INT_CLR_S  26
/** SPI_MEM_S_TX_TRANS_UDF_INT_CLR : WT; bitpos: [27]; default: 0;
 *  The clear bit for SPI_MEM_S_TX_TRANS_UDF_INT interrupt.
 */
#define SPI_MEM_S_TX_TRANS_UDF_INT_CLR    (BIT(27))
#define SPI_MEM_S_TX_TRANS_UDF_INT_CLR_M  (SPI_MEM_S_TX_TRANS_UDF_INT_CLR_V << SPI_MEM_S_TX_TRANS_UDF_INT_CLR_S)
#define SPI_MEM_S_TX_TRANS_UDF_INT_CLR_V  0x00000001U
#define SPI_MEM_S_TX_TRANS_UDF_INT_CLR_S  27
/** SPI_MEM_S_DQS0_AFIFO_OVF_INT_CLR : WT; bitpos: [28]; default: 0;
 *  The clear bit for SPI_MEM_S_DQS0_AFIFO_OVF_INT interrupt.
 */
#define SPI_MEM_S_DQS0_AFIFO_OVF_INT_CLR    (BIT(28))
#define SPI_MEM_S_DQS0_AFIFO_OVF_INT_CLR_M  (SPI_MEM_S_DQS0_AFIFO_OVF_INT_CLR_V << SPI_MEM_S_DQS0_AFIFO_OVF_INT_CLR_S)
#define SPI_MEM_S_DQS0_AFIFO_OVF_INT_CLR_V  0x00000001U
#define SPI_MEM_S_DQS0_AFIFO_OVF_INT_CLR_S  28
/** SPI_MEM_S_DQS1_AFIFO_OVF_INT_CLR : WT; bitpos: [29]; default: 0;
 *  The clear bit for SPI_MEM_S_DQS1_AFIFO_OVF_INT interrupt.
 */
#define SPI_MEM_S_DQS1_AFIFO_OVF_INT_CLR    (BIT(29))
#define SPI_MEM_S_DQS1_AFIFO_OVF_INT_CLR_M  (SPI_MEM_S_DQS1_AFIFO_OVF_INT_CLR_V << SPI_MEM_S_DQS1_AFIFO_OVF_INT_CLR_S)
#define SPI_MEM_S_DQS1_AFIFO_OVF_INT_CLR_V  0x00000001U
#define SPI_MEM_S_DQS1_AFIFO_OVF_INT_CLR_S  29
/** SPI_MEM_S_BUS_FIFO1_UDF_INT_CLR : WT; bitpos: [30]; default: 0;
 *  The clear bit for SPI_MEM_S_BUS_FIFO1_UDF_INT interrupt.
 */
#define SPI_MEM_S_BUS_FIFO1_UDF_INT_CLR    (BIT(30))
#define SPI_MEM_S_BUS_FIFO1_UDF_INT_CLR_M  (SPI_MEM_S_BUS_FIFO1_UDF_INT_CLR_V << SPI_MEM_S_BUS_FIFO1_UDF_INT_CLR_S)
#define SPI_MEM_S_BUS_FIFO1_UDF_INT_CLR_V  0x00000001U
#define SPI_MEM_S_BUS_FIFO1_UDF_INT_CLR_S  30
/** SPI_MEM_S_BUS_FIFO0_UDF_INT_CLR : WT; bitpos: [31]; default: 0;
 *  The clear bit for SPI_MEM_S_BUS_FIFO0_UDF_INT interrupt.
 */
#define SPI_MEM_S_BUS_FIFO0_UDF_INT_CLR    (BIT(31))
#define SPI_MEM_S_BUS_FIFO0_UDF_INT_CLR_M  (SPI_MEM_S_BUS_FIFO0_UDF_INT_CLR_V << SPI_MEM_S_BUS_FIFO0_UDF_INT_CLR_S)
#define SPI_MEM_S_BUS_FIFO0_UDF_INT_CLR_V  0x00000001U
#define SPI_MEM_S_BUS_FIFO0_UDF_INT_CLR_S  31

/** SPI_MEM_S_INT_RAW_REG register
 *  SPI0 interrupt raw register
 */
#define SPI_MEM_S_INT_RAW_REG (DR_REG_PSRAM_MSPI0_BASE + 0xc8)
/** SPI_MEM_S_SLV_ST_END_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw bit for SPI_MEM_S_SLV_ST_END_INT interrupt. 1: Triggered when spi0_slv_st
 *  is changed from non idle state to idle state. It means that SPI_CS raises high. 0:
 *  Others
 */
#define SPI_MEM_S_SLV_ST_END_INT_RAW    (BIT(3))
#define SPI_MEM_S_SLV_ST_END_INT_RAW_M  (SPI_MEM_S_SLV_ST_END_INT_RAW_V << SPI_MEM_S_SLV_ST_END_INT_RAW_S)
#define SPI_MEM_S_SLV_ST_END_INT_RAW_V  0x00000001U
#define SPI_MEM_S_SLV_ST_END_INT_RAW_S  3
/** SPI_MEM_S_MST_ST_END_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw bit for SPI_MEM_S_MST_ST_END_INT interrupt. 1: Triggered when spi0_mst_st
 *  is changed from non idle state to idle state. 0: Others.
 */
#define SPI_MEM_S_MST_ST_END_INT_RAW    (BIT(4))
#define SPI_MEM_S_MST_ST_END_INT_RAW_M  (SPI_MEM_S_MST_ST_END_INT_RAW_V << SPI_MEM_S_MST_ST_END_INT_RAW_S)
#define SPI_MEM_S_MST_ST_END_INT_RAW_V  0x00000001U
#define SPI_MEM_S_MST_ST_END_INT_RAW_S  4
/** SPI_MEM_S_ECC_ERR_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  The raw bit for SPI_MEM_S_ECC_ERR_INT interrupt. When SPI_MEM_S_FMEM_ECC_ERR_INT_EN
 *  is set and  SPI_MEM_S_SMEM_ECC_ERR_INT_EN is cleared, this bit is triggered when
 *  the error times of SPI0/1 ECC read flash are equal or bigger than
 *  SPI_MEM_S_ECC_ERR_INT_NUM. When SPI_MEM_S_FMEM_ECC_ERR_INT_EN is cleared and
 *  SPI_MEM_S_SMEM_ECC_ERR_INT_EN is set, this bit is triggered when the error times of
 *  SPI0/1 ECC read external RAM are equal or bigger than SPI_MEM_S_ECC_ERR_INT_NUM.
 *  When SPI_MEM_S_FMEM_ECC_ERR_INT_EN and  SPI_MEM_S_SMEM_ECC_ERR_INT_EN are set, this
 *  bit is triggered when the total error times of SPI0/1 ECC read external RAM and
 *  flash are equal or bigger than SPI_MEM_S_ECC_ERR_INT_NUM. When
 *  SPI_MEM_S_FMEM_ECC_ERR_INT_EN and  SPI_MEM_S_SMEM_ECC_ERR_INT_EN are cleared, this
 *  bit will not be triggered.
 */
#define SPI_MEM_S_ECC_ERR_INT_RAW    (BIT(5))
#define SPI_MEM_S_ECC_ERR_INT_RAW_M  (SPI_MEM_S_ECC_ERR_INT_RAW_V << SPI_MEM_S_ECC_ERR_INT_RAW_S)
#define SPI_MEM_S_ECC_ERR_INT_RAW_V  0x00000001U
#define SPI_MEM_S_ECC_ERR_INT_RAW_S  5
/** SPI_MEM_S_PMS_REJECT_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  The raw bit for SPI_MEM_S_PMS_REJECT_INT interrupt. 1: Triggered when SPI1 access
 *  is rejected. 0: Others.
 */
#define SPI_MEM_S_PMS_REJECT_INT_RAW    (BIT(6))
#define SPI_MEM_S_PMS_REJECT_INT_RAW_M  (SPI_MEM_S_PMS_REJECT_INT_RAW_V << SPI_MEM_S_PMS_REJECT_INT_RAW_S)
#define SPI_MEM_S_PMS_REJECT_INT_RAW_V  0x00000001U
#define SPI_MEM_S_PMS_REJECT_INT_RAW_S  6
/** SPI_MEM_S_AXI_RADDR_ERR_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  The raw bit for SPI_MEM_S_AXI_RADDR_ERR_INT interrupt. 1: Triggered when AXI read
 *  address is invalid by compared to MMU configuration. 0: Others.
 */
#define SPI_MEM_S_AXI_RADDR_ERR_INT_RAW    (BIT(7))
#define SPI_MEM_S_AXI_RADDR_ERR_INT_RAW_M  (SPI_MEM_S_AXI_RADDR_ERR_INT_RAW_V << SPI_MEM_S_AXI_RADDR_ERR_INT_RAW_S)
#define SPI_MEM_S_AXI_RADDR_ERR_INT_RAW_V  0x00000001U
#define SPI_MEM_S_AXI_RADDR_ERR_INT_RAW_S  7
/** SPI_MEM_S_AXI_WR_FLASH_ERR_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The raw bit for SPI_MEM_S_AXI_WR_FALSH_ERR_INT interrupt. 1: Triggered when AXI
 *  write flash request is received. 0: Others.
 */
#define SPI_MEM_S_AXI_WR_FLASH_ERR_INT_RAW    (BIT(8))
#define SPI_MEM_S_AXI_WR_FLASH_ERR_INT_RAW_M  (SPI_MEM_S_AXI_WR_FLASH_ERR_INT_RAW_V << SPI_MEM_S_AXI_WR_FLASH_ERR_INT_RAW_S)
#define SPI_MEM_S_AXI_WR_FLASH_ERR_INT_RAW_V  0x00000001U
#define SPI_MEM_S_AXI_WR_FLASH_ERR_INT_RAW_S  8
/** SPI_MEM_S_AXI_WADDR_ERR_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  The raw bit for SPI_MEM_S_AXI_WADDR_ERR_INT interrupt. 1: Triggered when AXI write
 *  address is invalid by compared to MMU configuration. 0: Others.
 */
#define SPI_MEM_S_AXI_WADDR_ERR_INT_RAW    (BIT(9))
#define SPI_MEM_S_AXI_WADDR_ERR_INT_RAW_M  (SPI_MEM_S_AXI_WADDR_ERR_INT_RAW_V << SPI_MEM_S_AXI_WADDR_ERR_INT_RAW_S)
#define SPI_MEM_S_AXI_WADDR_ERR_INT_RAW_V  0x00000001U
#define SPI_MEM_S_AXI_WADDR_ERR_INT_RAW_S  9
/** SPI_MEM_S_RX_TRANS_OVF_INT_RAW : R/WTC/SS; bitpos: [26]; default: 0;
 *  The raw bit for  SPI_MEM_S_RX_TRANS_OVF_INT interrupt. 1: Triggered when the rx
 *  fifo to spi bus is overrflow.
 */
#define SPI_MEM_S_RX_TRANS_OVF_INT_RAW    (BIT(26))
#define SPI_MEM_S_RX_TRANS_OVF_INT_RAW_M  (SPI_MEM_S_RX_TRANS_OVF_INT_RAW_V << SPI_MEM_S_RX_TRANS_OVF_INT_RAW_S)
#define SPI_MEM_S_RX_TRANS_OVF_INT_RAW_V  0x00000001U
#define SPI_MEM_S_RX_TRANS_OVF_INT_RAW_S  26
/** SPI_MEM_S_TX_TRANS_UDF_INT_RAW : R/WTC/SS; bitpos: [27]; default: 0;
 *  The raw bit for SPI_MEM_S_TX_TRANS_UDF_INT interrupt. 1: Triggered when the tx fifo
 *  to spi bus is underflow.
 */
#define SPI_MEM_S_TX_TRANS_UDF_INT_RAW    (BIT(27))
#define SPI_MEM_S_TX_TRANS_UDF_INT_RAW_M  (SPI_MEM_S_TX_TRANS_UDF_INT_RAW_V << SPI_MEM_S_TX_TRANS_UDF_INT_RAW_S)
#define SPI_MEM_S_TX_TRANS_UDF_INT_RAW_V  0x00000001U
#define SPI_MEM_S_TX_TRANS_UDF_INT_RAW_S  27
/** SPI_MEM_S_DQS0_AFIFO_OVF_INT_RAW : R/WTC/SS; bitpos: [28]; default: 0;
 *  The raw bit for SPI_MEM_S_DQS0_AFIFO_OVF_INT interrupt. 1: Triggered when the AFIFO
 *  connected to SPI_DQS1 is overflow.
 */
#define SPI_MEM_S_DQS0_AFIFO_OVF_INT_RAW    (BIT(28))
#define SPI_MEM_S_DQS0_AFIFO_OVF_INT_RAW_M  (SPI_MEM_S_DQS0_AFIFO_OVF_INT_RAW_V << SPI_MEM_S_DQS0_AFIFO_OVF_INT_RAW_S)
#define SPI_MEM_S_DQS0_AFIFO_OVF_INT_RAW_V  0x00000001U
#define SPI_MEM_S_DQS0_AFIFO_OVF_INT_RAW_S  28
/** SPI_MEM_S_DQS1_AFIFO_OVF_INT_RAW : R/WTC/SS; bitpos: [29]; default: 0;
 *  The raw bit for SPI_MEM_S_DQS1_AFIFO_OVF_INT interrupt. 1: Triggered when the AFIFO
 *  connected to SPI_DQS is overflow.
 */
#define SPI_MEM_S_DQS1_AFIFO_OVF_INT_RAW    (BIT(29))
#define SPI_MEM_S_DQS1_AFIFO_OVF_INT_RAW_M  (SPI_MEM_S_DQS1_AFIFO_OVF_INT_RAW_V << SPI_MEM_S_DQS1_AFIFO_OVF_INT_RAW_S)
#define SPI_MEM_S_DQS1_AFIFO_OVF_INT_RAW_V  0x00000001U
#define SPI_MEM_S_DQS1_AFIFO_OVF_INT_RAW_S  29
/** SPI_MEM_S_BUS_FIFO1_UDF_INT_RAW : R/WTC/SS; bitpos: [30]; default: 0;
 *  The raw bit for SPI_MEM_S_BUS_FIFO1_UDF_INT interrupt. 1: Triggered when BUS1 FIFO
 *  is underflow.
 */
#define SPI_MEM_S_BUS_FIFO1_UDF_INT_RAW    (BIT(30))
#define SPI_MEM_S_BUS_FIFO1_UDF_INT_RAW_M  (SPI_MEM_S_BUS_FIFO1_UDF_INT_RAW_V << SPI_MEM_S_BUS_FIFO1_UDF_INT_RAW_S)
#define SPI_MEM_S_BUS_FIFO1_UDF_INT_RAW_V  0x00000001U
#define SPI_MEM_S_BUS_FIFO1_UDF_INT_RAW_S  30
/** SPI_MEM_S_BUS_FIFO0_UDF_INT_RAW : R/WTC/SS; bitpos: [31]; default: 0;
 *  The raw bit for SPI_MEM_S_BUS_FIFO0_UDF_INT interrupt. 1: Triggered when BUS0 FIFO
 *  is underflow.
 */
#define SPI_MEM_S_BUS_FIFO0_UDF_INT_RAW    (BIT(31))
#define SPI_MEM_S_BUS_FIFO0_UDF_INT_RAW_M  (SPI_MEM_S_BUS_FIFO0_UDF_INT_RAW_V << SPI_MEM_S_BUS_FIFO0_UDF_INT_RAW_S)
#define SPI_MEM_S_BUS_FIFO0_UDF_INT_RAW_V  0x00000001U
#define SPI_MEM_S_BUS_FIFO0_UDF_INT_RAW_S  31

