espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/spi_mem_s_reg.h
/** SPI_MEM_S_ECC_CTRL_REG register
 *  MSPI ECC control register
 */
#define SPI_MEM_S_ECC_CTRL_REG (DR_REG_PSRAM_MSPI0_BASE + 0x168)
/** SPI_MEM_S_ECC_ERR_CNT : R/SS/WTC; bitpos: [10:5]; default: 0;
 *  This bits show the error times of MSPI ECC read. It is cleared by when
 *  SPI_MEM_S_ECC_ERR_INT_CLR bit is set.
 */
#define SPI_MEM_S_ECC_ERR_CNT    0x0000003FU
#define SPI_MEM_S_ECC_ERR_CNT_M  (SPI_MEM_S_ECC_ERR_CNT_V << SPI_MEM_S_ECC_ERR_CNT_S)
#define SPI_MEM_S_ECC_ERR_CNT_V  0x0000003FU
#define SPI_MEM_S_ECC_ERR_CNT_S  5
/** SPI_MEM_S_FMEM_ECC_ERR_INT_NUM : R/W; bitpos: [16:11]; default: 10;
 *  Set the error times of MSPI ECC read to generate MSPI SPI_MEM_S_ECC_ERR_INT
 *  interrupt.
 */
#define SPI_MEM_S_FMEM_ECC_ERR_INT_NUM    0x0000003FU
#define SPI_MEM_S_FMEM_ECC_ERR_INT_NUM_M  (SPI_MEM_S_FMEM_ECC_ERR_INT_NUM_V << SPI_MEM_S_FMEM_ECC_ERR_INT_NUM_S)
#define SPI_MEM_S_FMEM_ECC_ERR_INT_NUM_V  0x0000003FU
#define SPI_MEM_S_FMEM_ECC_ERR_INT_NUM_S  11
/** SPI_MEM_S_FMEM_ECC_ERR_INT_EN : R/W; bitpos: [17]; default: 0;
 *  Set this bit to calculate the error times of MSPI ECC read when accesses to flash.
 */
#define SPI_MEM_S_FMEM_ECC_ERR_INT_EN    (BIT(17))
#define SPI_MEM_S_FMEM_ECC_ERR_INT_EN_M  (SPI_MEM_S_FMEM_ECC_ERR_INT_EN_V << SPI_MEM_S_FMEM_ECC_ERR_INT_EN_S)
#define SPI_MEM_S_FMEM_ECC_ERR_INT_EN_V  0x00000001U
#define SPI_MEM_S_FMEM_ECC_ERR_INT_EN_S  17
/** SPI_MEM_S_FMEM_PAGE_SIZE : R/W; bitpos: [19:18]; default: 0;
 *  Set the page size of the flash accessed by MSPI. 0: 256 bytes. 1: 512 bytes. 2:
 *  1024 bytes. 3: 2048 bytes.
 */
#define SPI_MEM_S_FMEM_PAGE_SIZE    0x00000003U
#define SPI_MEM_S_FMEM_PAGE_SIZE_M  (SPI_MEM_S_FMEM_PAGE_SIZE_V << SPI_MEM_S_FMEM_PAGE_SIZE_S)
#define SPI_MEM_S_FMEM_PAGE_SIZE_V  0x00000003U
#define SPI_MEM_S_FMEM_PAGE_SIZE_S  18
/** SPI_MEM_S_FMEM_ECC_ADDR_EN : R/W; bitpos: [20]; default: 0;
 *  Set this bit to enable MSPI ECC address conversion, no matter MSPI accesses to the
 *  ECC region or non-ECC region of flash. If there is no ECC region in flash, this bit
 *  should be 0. Otherwise, this bit should be 1.
 */
#define SPI_MEM_S_FMEM_ECC_ADDR_EN    (BIT(20))
#define SPI_MEM_S_FMEM_ECC_ADDR_EN_M  (SPI_MEM_S_FMEM_ECC_ADDR_EN_V << SPI_MEM_S_FMEM_ECC_ADDR_EN_S)
#define SPI_MEM_S_FMEM_ECC_ADDR_EN_V  0x00000001U
#define SPI_MEM_S_FMEM_ECC_ADDR_EN_S  20
/** SPI_MEM_S_USR_ECC_ADDR_EN : R/W; bitpos: [21]; default: 0;
 *  Set this bit to enable ECC address convert in SPI0/1 USR_CMD transfer.
 */
#define SPI_MEM_S_USR_ECC_ADDR_EN    (BIT(21))
#define SPI_MEM_S_USR_ECC_ADDR_EN_M  (SPI_MEM_S_USR_ECC_ADDR_EN_V << SPI_MEM_S_USR_ECC_ADDR_EN_S)
#define SPI_MEM_S_USR_ECC_ADDR_EN_V  0x00000001U
#define SPI_MEM_S_USR_ECC_ADDR_EN_S  21
/** SPI_MEM_S_ECC_CONTINUE_RECORD_ERR_EN : R/W; bitpos: [24]; default: 1;
 *  1: The error information in SPI_MEM_S_ECC_ERR_BITS and SPI_MEM_S_ECC_ERR_ADDR is
 *  updated when there is an ECC error. 0: SPI_MEM_S_ECC_ERR_BITS and
 *  SPI_MEM_S_ECC_ERR_ADDR record the first ECC error information.
 */
#define SPI_MEM_S_ECC_CONTINUE_RECORD_ERR_EN    (BIT(24))
#define SPI_MEM_S_ECC_CONTINUE_RECORD_ERR_EN_M  (SPI_MEM_S_ECC_CONTINUE_RECORD_ERR_EN_V << SPI_MEM_S_ECC_CONTINUE_RECORD_ERR_EN_S)
#define SPI_MEM_S_ECC_CONTINUE_RECORD_ERR_EN_V  0x00000001U
#define SPI_MEM_S_ECC_CONTINUE_RECORD_ERR_EN_S  24
/** SPI_MEM_S_ECC_ERR_BITS : R/SS/WTC; bitpos: [31:25]; default: 0;
 *  Records the first ECC error bit number in the 16 bytes(From 0~127, corresponding to
 *  byte 0 bit 0 to byte 15 bit 7)
 */
#define SPI_MEM_S_ECC_ERR_BITS    0x0000007FU
#define SPI_MEM_S_ECC_ERR_BITS_M  (SPI_MEM_S_ECC_ERR_BITS_V << SPI_MEM_S_ECC_ERR_BITS_S)
#define SPI_MEM_S_ECC_ERR_BITS_V  0x0000007FU
#define SPI_MEM_S_ECC_ERR_BITS_S  25

/** SPI_MEM_S_ECC_ERR_ADDR_REG register
 *  MSPI ECC error address register
 */
#define SPI_MEM_S_ECC_ERR_ADDR_REG (DR_REG_PSRAM_MSPI0_BASE + 0x16c)
/** SPI_MEM_S_ECC_ERR_ADDR : R/SS/WTC; bitpos: [26:0]; default: 0;
 *  This bits show the first MSPI ECC error address. It is cleared by when
 *  SPI_MEM_S_ECC_ERR_INT_CLR bit is set.
 */
#define SPI_MEM_S_ECC_ERR_ADDR    0x07FFFFFFU
#define SPI_MEM_S_ECC_ERR_ADDR_M  (SPI_MEM_S_ECC_ERR_ADDR_V << SPI_MEM_S_ECC_ERR_ADDR_S)
#define SPI_MEM_S_ECC_ERR_ADDR_V  0x07FFFFFFU
#define SPI_MEM_S_ECC_ERR_ADDR_S  0

/** SPI_MEM_S_AXI_ERR_ADDR_REG register
 *  SPI0 AXI request error address.
 */
#define SPI_MEM_S_AXI_ERR_ADDR_REG (DR_REG_PSRAM_MSPI0_BASE + 0x170)
/** SPI_MEM_S_AXI_ERR_ADDR : R/SS/WTC; bitpos: [26:0]; default: 0;
 *  This bits show the first AXI write/read invalid error or AXI write flash error
 *  address. It is cleared by when SPI_MEM_S_AXI_WADDR_ERR_INT_CLR,
 *  SPI_MEM_S_AXI_WR_FLASH_ERR_IN_CLR or SPI_MEM_S_AXI_RADDR_ERR_IN_CLR bit is set.
 */
#define SPI_MEM_S_AXI_ERR_ADDR    0x07FFFFFFU
#define SPI_MEM_S_AXI_ERR_ADDR_M  (SPI_MEM_S_AXI_ERR_ADDR_V << SPI_MEM_S_AXI_ERR_ADDR_S)
#define SPI_MEM_S_AXI_ERR_ADDR_V  0x07FFFFFFU
#define SPI_MEM_S_AXI_ERR_ADDR_S  0

/** SPI_MEM_S_SMEM_ECC_CTRL_REG register
 *  MSPI ECC control register
 */
#define SPI_MEM_S_SMEM_ECC_CTRL_REG (DR_REG_PSRAM_MSPI0_BASE + 0x174)
/** SPI_MEM_S_SMEM_ECC_ERR_INT_EN : R/W; bitpos: [17]; default: 0;
 *  Set this bit to calculate the error times of MSPI ECC read when accesses to
 *  external RAM.
 */
#define SPI_MEM_S_SMEM_ECC_ERR_INT_EN    (BIT(17))
#define SPI_MEM_S_SMEM_ECC_ERR_INT_EN_M  (SPI_MEM_S_SMEM_ECC_ERR_INT_EN_V << SPI_MEM_S_SMEM_ECC_ERR_INT_EN_S)
#define SPI_MEM_S_SMEM_ECC_ERR_INT_EN_V  0x00000001U
#define SPI_MEM_S_SMEM_ECC_ERR_INT_EN_S  17
/** SPI_MEM_S_SMEM_PAGE_SIZE : R/W; bitpos: [19:18]; default: 2;
 *  Set the page size of the external RAM accessed by MSPI. 0: 256 bytes. 1: 512 bytes.
 *  2: 1024 bytes. 3: 2048 bytes.
 */
#define SPI_MEM_S_SMEM_PAGE_SIZE    0x00000003U
#define SPI_MEM_S_SMEM_PAGE_SIZE_M  (SPI_MEM_S_SMEM_PAGE_SIZE_V << SPI_MEM_S_SMEM_PAGE_SIZE_S)
#define SPI_MEM_S_SMEM_PAGE_SIZE_V  0x00000003U
#define SPI_MEM_S_SMEM_PAGE_SIZE_S  18
/** SPI_MEM_S_SMEM_ECC_ADDR_EN : R/W; bitpos: [20]; default: 0;
 *  Set this bit to enable MSPI ECC address conversion, no matter MSPI accesses to the
 *  ECC region or non-ECC region of external RAM. If there is no ECC region in external
 *  RAM, this bit should be 0. Otherwise, this bit should be 1.
 */
#define SPI_MEM_S_SMEM_ECC_ADDR_EN    (BIT(20))
#define SPI_MEM_S_SMEM_ECC_ADDR_EN_M  (SPI_MEM_S_SMEM_ECC_ADDR_EN_V << SPI_MEM_S_SMEM_ECC_ADDR_EN_S)
#define SPI_MEM_S_SMEM_ECC_ADDR_EN_V  0x00000001U
#define SPI_MEM_S_SMEM_ECC_ADDR_EN_S  20

