espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/spi_mem_s_reg.h
/** SPI_MEM_S_SMEM_AXI_ADDR_CTRL_REG register
 *  SPI0 AXI address control register
 */
#define SPI_MEM_S_SMEM_AXI_ADDR_CTRL_REG (DR_REG_PSRAM_MSPI0_BASE + 0x178)
/** SPI_MEM_S_ALL_FIFO_EMPTY : RO; bitpos: [26]; default: 1;
 *  The empty status of all AFIFO and SYNC_FIFO in MSPI module. 1: All AXI transfers
 *  and SPI0 transfers are done. 0: Others.
 */
#define SPI_MEM_S_ALL_FIFO_EMPTY    (BIT(26))
#define SPI_MEM_S_ALL_FIFO_EMPTY_M  (SPI_MEM_S_ALL_FIFO_EMPTY_V << SPI_MEM_S_ALL_FIFO_EMPTY_S)
#define SPI_MEM_S_ALL_FIFO_EMPTY_V  0x00000001U
#define SPI_MEM_S_ALL_FIFO_EMPTY_S  26
/** SPI_MEM_S_RDATA_AFIFO_REMPTY : RO; bitpos: [27]; default: 1;
 *  1: RDATA_AFIFO is empty. 0: At least one AXI read transfer is pending.
 */
#define SPI_MEM_S_RDATA_AFIFO_REMPTY    (BIT(27))
#define SPI_MEM_S_RDATA_AFIFO_REMPTY_M  (SPI_MEM_S_RDATA_AFIFO_REMPTY_V << SPI_MEM_S_RDATA_AFIFO_REMPTY_S)
#define SPI_MEM_S_RDATA_AFIFO_REMPTY_V  0x00000001U
#define SPI_MEM_S_RDATA_AFIFO_REMPTY_S  27
/** SPI_MEM_S_RADDR_AFIFO_REMPTY : RO; bitpos: [28]; default: 1;
 *  1: AXI_RADDR_CTL_AFIFO is empty. 0: At least one AXI read transfer is pending.
 */
#define SPI_MEM_S_RADDR_AFIFO_REMPTY    (BIT(28))
#define SPI_MEM_S_RADDR_AFIFO_REMPTY_M  (SPI_MEM_S_RADDR_AFIFO_REMPTY_V << SPI_MEM_S_RADDR_AFIFO_REMPTY_S)
#define SPI_MEM_S_RADDR_AFIFO_REMPTY_V  0x00000001U
#define SPI_MEM_S_RADDR_AFIFO_REMPTY_S  28
/** SPI_MEM_S_WDATA_AFIFO_REMPTY : RO; bitpos: [29]; default: 1;
 *  1: WDATA_AFIFO is empty. 0: At least one AXI write transfer is pending.
 */
#define SPI_MEM_S_WDATA_AFIFO_REMPTY    (BIT(29))
#define SPI_MEM_S_WDATA_AFIFO_REMPTY_M  (SPI_MEM_S_WDATA_AFIFO_REMPTY_V << SPI_MEM_S_WDATA_AFIFO_REMPTY_S)
#define SPI_MEM_S_WDATA_AFIFO_REMPTY_V  0x00000001U
#define SPI_MEM_S_WDATA_AFIFO_REMPTY_S  29
/** SPI_MEM_S_WBLEN_AFIFO_REMPTY : RO; bitpos: [30]; default: 1;
 *  1: WBLEN_AFIFO is empty. 0: At least one AXI write transfer is pending.
 */
#define SPI_MEM_S_WBLEN_AFIFO_REMPTY    (BIT(30))
#define SPI_MEM_S_WBLEN_AFIFO_REMPTY_M  (SPI_MEM_S_WBLEN_AFIFO_REMPTY_V << SPI_MEM_S_WBLEN_AFIFO_REMPTY_S)
#define SPI_MEM_S_WBLEN_AFIFO_REMPTY_V  0x00000001U
#define SPI_MEM_S_WBLEN_AFIFO_REMPTY_S  30
/** SPI_MEM_S_ALL_AXI_TRANS_AFIFO_EMPTY : RO; bitpos: [31]; default: 1;
 *  This bit is set when WADDR_AFIFO, WBLEN_AFIFO, WDATA_AFIFO, AXI_RADDR_CTL_AFIFO and
 *  RDATA_AFIFO are empty and spi0_mst_st is IDLE.
 */
#define SPI_MEM_S_ALL_AXI_TRANS_AFIFO_EMPTY    (BIT(31))
#define SPI_MEM_S_ALL_AXI_TRANS_AFIFO_EMPTY_M  (SPI_MEM_S_ALL_AXI_TRANS_AFIFO_EMPTY_V << SPI_MEM_S_ALL_AXI_TRANS_AFIFO_EMPTY_S)
#define SPI_MEM_S_ALL_AXI_TRANS_AFIFO_EMPTY_V  0x00000001U
#define SPI_MEM_S_ALL_AXI_TRANS_AFIFO_EMPTY_S  31

/** SPI_MEM_S_AXI_ERR_RESP_EN_REG register
 *  SPI0 AXI error response enable register
 */
#define SPI_MEM_S_AXI_ERR_RESP_EN_REG (DR_REG_PSRAM_MSPI0_BASE + 0x17c)
/** SPI_MEM_S_AW_RESP_EN_MMU_VLD : R/W; bitpos: [0]; default: 0;
 *  Set this bit  to enable AXI response function for mmu valid err in axi write trans.
 */
#define SPI_MEM_S_AW_RESP_EN_MMU_VLD    (BIT(0))
#define SPI_MEM_S_AW_RESP_EN_MMU_VLD_M  (SPI_MEM_S_AW_RESP_EN_MMU_VLD_V << SPI_MEM_S_AW_RESP_EN_MMU_VLD_S)
#define SPI_MEM_S_AW_RESP_EN_MMU_VLD_V  0x00000001U
#define SPI_MEM_S_AW_RESP_EN_MMU_VLD_S  0
/** SPI_MEM_S_AW_RESP_EN_MMU_GID : R/W; bitpos: [1]; default: 0;
 *  Set this bit  to enable AXI response function for mmu gid err in axi write trans.
 */
#define SPI_MEM_S_AW_RESP_EN_MMU_GID    (BIT(1))
#define SPI_MEM_S_AW_RESP_EN_MMU_GID_M  (SPI_MEM_S_AW_RESP_EN_MMU_GID_V << SPI_MEM_S_AW_RESP_EN_MMU_GID_S)
#define SPI_MEM_S_AW_RESP_EN_MMU_GID_V  0x00000001U
#define SPI_MEM_S_AW_RESP_EN_MMU_GID_S  1
/** SPI_MEM_S_AW_RESP_EN_AXI_SIZE : R/W; bitpos: [2]; default: 0;
 *  Set this bit  to enable AXI response function for axi size err in axi write trans.
 */
#define SPI_MEM_S_AW_RESP_EN_AXI_SIZE    (BIT(2))
#define SPI_MEM_S_AW_RESP_EN_AXI_SIZE_M  (SPI_MEM_S_AW_RESP_EN_AXI_SIZE_V << SPI_MEM_S_AW_RESP_EN_AXI_SIZE_S)
#define SPI_MEM_S_AW_RESP_EN_AXI_SIZE_V  0x00000001U
#define SPI_MEM_S_AW_RESP_EN_AXI_SIZE_S  2
/** SPI_MEM_S_AW_RESP_EN_AXI_FLASH : R/W; bitpos: [3]; default: 0;
 *  Set this bit  to enable AXI response function for axi flash err in axi write trans.
 */
#define SPI_MEM_S_AW_RESP_EN_AXI_FLASH    (BIT(3))
#define SPI_MEM_S_AW_RESP_EN_AXI_FLASH_M  (SPI_MEM_S_AW_RESP_EN_AXI_FLASH_V << SPI_MEM_S_AW_RESP_EN_AXI_FLASH_S)
#define SPI_MEM_S_AW_RESP_EN_AXI_FLASH_V  0x00000001U
#define SPI_MEM_S_AW_RESP_EN_AXI_FLASH_S  3
/** SPI_MEM_S_AW_RESP_EN_MMU_ECC : R/W; bitpos: [4]; default: 0;
 *  Set this bit  to enable AXI response function for mmu ecc err in axi write trans.
 */
#define SPI_MEM_S_AW_RESP_EN_MMU_ECC    (BIT(4))
#define SPI_MEM_S_AW_RESP_EN_MMU_ECC_M  (SPI_MEM_S_AW_RESP_EN_MMU_ECC_V << SPI_MEM_S_AW_RESP_EN_MMU_ECC_S)
#define SPI_MEM_S_AW_RESP_EN_MMU_ECC_V  0x00000001U
#define SPI_MEM_S_AW_RESP_EN_MMU_ECC_S  4
/** SPI_MEM_S_AW_RESP_EN_MMU_SENS : R/W; bitpos: [5]; default: 0;
 *  Set this bit  to enable AXI response function for mmu sens in err axi write trans.
 */
#define SPI_MEM_S_AW_RESP_EN_MMU_SENS    (BIT(5))
#define SPI_MEM_S_AW_RESP_EN_MMU_SENS_M  (SPI_MEM_S_AW_RESP_EN_MMU_SENS_V << SPI_MEM_S_AW_RESP_EN_MMU_SENS_S)
#define SPI_MEM_S_AW_RESP_EN_MMU_SENS_V  0x00000001U
#define SPI_MEM_S_AW_RESP_EN_MMU_SENS_S  5
/** SPI_MEM_S_AW_RESP_EN_AXI_WSTRB : R/W; bitpos: [6]; default: 0;
 *  Set this bit  to enable AXI response function for axi wstrb err in axi write trans.
 */
#define SPI_MEM_S_AW_RESP_EN_AXI_WSTRB    (BIT(6))
#define SPI_MEM_S_AW_RESP_EN_AXI_WSTRB_M  (SPI_MEM_S_AW_RESP_EN_AXI_WSTRB_V << SPI_MEM_S_AW_RESP_EN_AXI_WSTRB_S)
#define SPI_MEM_S_AW_RESP_EN_AXI_WSTRB_V  0x00000001U
#define SPI_MEM_S_AW_RESP_EN_AXI_WSTRB_S  6
/** SPI_MEM_S_AR_RESP_EN_MMU_VLD : R/W; bitpos: [7]; default: 0;
 *  Set this bit  to enable AXI response function for mmu valid err in axi read trans.
 */
#define SPI_MEM_S_AR_RESP_EN_MMU_VLD    (BIT(7))
#define SPI_MEM_S_AR_RESP_EN_MMU_VLD_M  (SPI_MEM_S_AR_RESP_EN_MMU_VLD_V << SPI_MEM_S_AR_RESP_EN_MMU_VLD_S)
#define SPI_MEM_S_AR_RESP_EN_MMU_VLD_V  0x00000001U
#define SPI_MEM_S_AR_RESP_EN_MMU_VLD_S  7
/** SPI_MEM_S_AR_RESP_EN_MMU_GID : R/W; bitpos: [8]; default: 0;
 *  Set this bit  to enable AXI response function for mmu gid err in axi read trans.
 */
#define SPI_MEM_S_AR_RESP_EN_MMU_GID    (BIT(8))
#define SPI_MEM_S_AR_RESP_EN_MMU_GID_M  (SPI_MEM_S_AR_RESP_EN_MMU_GID_V << SPI_MEM_S_AR_RESP_EN_MMU_GID_S)
#define SPI_MEM_S_AR_RESP_EN_MMU_GID_V  0x00000001U
#define SPI_MEM_S_AR_RESP_EN_MMU_GID_S  8
/** SPI_MEM_S_AR_RESP_EN_MMU_ECC : R/W; bitpos: [9]; default: 0;
 *  Set this bit  to enable AXI response function for mmu ecc err in axi read trans.
 */
#define SPI_MEM_S_AR_RESP_EN_MMU_ECC    (BIT(9))
#define SPI_MEM_S_AR_RESP_EN_MMU_ECC_M  (SPI_MEM_S_AR_RESP_EN_MMU_ECC_V << SPI_MEM_S_AR_RESP_EN_MMU_ECC_S)
#define SPI_MEM_S_AR_RESP_EN_MMU_ECC_V  0x00000001U
#define SPI_MEM_S_AR_RESP_EN_MMU_ECC_S  9
/** SPI_MEM_S_AR_RESP_EN_MMU_SENS : R/W; bitpos: [10]; default: 0;
 *  Set this bit  to enable AXI response function for mmu sensitive err in axi read
 *  trans.
 */
#define SPI_MEM_S_AR_RESP_EN_MMU_SENS    (BIT(10))
#define SPI_MEM_S_AR_RESP_EN_MMU_SENS_M  (SPI_MEM_S_AR_RESP_EN_MMU_SENS_V << SPI_MEM_S_AR_RESP_EN_MMU_SENS_S)
#define SPI_MEM_S_AR_RESP_EN_MMU_SENS_V  0x00000001U
#define SPI_MEM_S_AR_RESP_EN_MMU_SENS_S  10
/** SPI_MEM_S_AR_RESP_EN_AXI_SIZE : R/W; bitpos: [11]; default: 0;
 *  Set this bit  to enable AXI response function for axi size err in axi read trans.
 */
#define SPI_MEM_S_AR_RESP_EN_AXI_SIZE    (BIT(11))
#define SPI_MEM_S_AR_RESP_EN_AXI_SIZE_M  (SPI_MEM_S_AR_RESP_EN_AXI_SIZE_V << SPI_MEM_S_AR_RESP_EN_AXI_SIZE_S)
#define SPI_MEM_S_AR_RESP_EN_AXI_SIZE_V  0x00000001U
#define SPI_MEM_S_AR_RESP_EN_AXI_SIZE_S  11

/** SPI_MEM_S_TIMING_CALI_REG register
 *  SPI0 flash timing calibration register
 */
#define SPI_MEM_S_TIMING_CALI_REG (DR_REG_PSRAM_MSPI0_BASE + 0x180)
/** SPI_MEM_S_TIMING_CLK_ENA : R/W; bitpos: [0]; default: 1;
 *  The bit is used to enable timing adjust clock for all reading operations.
 */
#define SPI_MEM_S_TIMING_CLK_ENA    (BIT(0))
#define SPI_MEM_S_TIMING_CLK_ENA_M  (SPI_MEM_S_TIMING_CLK_ENA_V << SPI_MEM_S_TIMING_CLK_ENA_S)
#define SPI_MEM_S_TIMING_CLK_ENA_V  0x00000001U
#define SPI_MEM_S_TIMING_CLK_ENA_S  0
/** SPI_MEM_S_TIMING_CALI : R/W; bitpos: [1]; default: 0;
 *  The bit is used to enable timing auto-calibration for all reading operations.
 */
#define SPI_MEM_S_TIMING_CALI    (BIT(1))
#define SPI_MEM_S_TIMING_CALI_M  (SPI_MEM_S_TIMING_CALI_V << SPI_MEM_S_TIMING_CALI_S)
#define SPI_MEM_S_TIMING_CALI_V  0x00000001U
#define SPI_MEM_S_TIMING_CALI_S  1
/** SPI_MEM_S_EXTRA_DUMMY_CYCLELEN : R/W; bitpos: [4:2]; default: 0;
 *  add extra dummy spi clock cycle length for spi clock calibration.
 */
#define SPI_MEM_S_EXTRA_DUMMY_CYCLELEN    0x00000007U
#define SPI_MEM_S_EXTRA_DUMMY_CYCLELEN_M  (SPI_MEM_S_EXTRA_DUMMY_CYCLELEN_V << SPI_MEM_S_EXTRA_DUMMY_CYCLELEN_S)
#define SPI_MEM_S_EXTRA_DUMMY_CYCLELEN_V  0x00000007U
#define SPI_MEM_S_EXTRA_DUMMY_CYCLELEN_S  2
/** SPI_MEM_S_DLL_TIMING_CALI : R/W; bitpos: [5]; default: 0;
 *  Set this bit to enable DLL for timing calibration in DDR mode when accessed to
 *  flash.
 */
#define SPI_MEM_S_DLL_TIMING_CALI    (BIT(5))
#define SPI_MEM_S_DLL_TIMING_CALI_M  (SPI_MEM_S_DLL_TIMING_CALI_V << SPI_MEM_S_DLL_TIMING_CALI_S)
#define SPI_MEM_S_DLL_TIMING_CALI_V  0x00000001U
#define SPI_MEM_S_DLL_TIMING_CALI_S  5
/** SPI_MEM_S_TIMING_CALI_UPDATE : WT; bitpos: [6]; default: 0;
 *  Set this bit to update delay mode, delay num and extra dummy in MSPI.
 */
#define SPI_MEM_S_TIMING_CALI_UPDATE    (BIT(6))
#define SPI_MEM_S_TIMING_CALI_UPDATE_M  (SPI_MEM_S_TIMING_CALI_UPDATE_V << SPI_MEM_S_TIMING_CALI_UPDATE_S)
#define SPI_MEM_S_TIMING_CALI_UPDATE_V  0x00000001U
#define SPI_MEM_S_TIMING_CALI_UPDATE_S  6

/** SPI_MEM_S_DIN_MODE_REG register
 *  MSPI flash input timing delay mode control register
 */
#define SPI_MEM_S_DIN_MODE_REG (DR_REG_PSRAM_MSPI0_BASE + 0x184)
/** SPI_MEM_S_DIN0_MODE : R/W; bitpos: [2:0]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_MEM_S_DIN0_MODE    0x00000007U
#define SPI_MEM_S_DIN0_MODE_M  (SPI_MEM_S_DIN0_MODE_V << SPI_MEM_S_DIN0_MODE_S)
#define SPI_MEM_S_DIN0_MODE_V  0x00000007U
#define SPI_MEM_S_DIN0_MODE_S  0
/** SPI_MEM_S_DIN1_MODE : R/W; bitpos: [5:3]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_MEM_S_DIN1_MODE    0x00000007U
#define SPI_MEM_S_DIN1_MODE_M  (SPI_MEM_S_DIN1_MODE_V << SPI_MEM_S_DIN1_MODE_S)
#define SPI_MEM_S_DIN1_MODE_V  0x00000007U
#define SPI_MEM_S_DIN1_MODE_S  3
/** SPI_MEM_S_DIN2_MODE : R/W; bitpos: [8:6]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_MEM_S_DIN2_MODE    0x00000007U
#define SPI_MEM_S_DIN2_MODE_M  (SPI_MEM_S_DIN2_MODE_V << SPI_MEM_S_DIN2_MODE_S)
#define SPI_MEM_S_DIN2_MODE_V  0x00000007U
#define SPI_MEM_S_DIN2_MODE_S  6
/** SPI_MEM_S_DIN3_MODE : R/W; bitpos: [11:9]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: input
 *  with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input with the
 *  spi_clk high edge,  6: input with the spi_clk low edge
 */
#define SPI_MEM_S_DIN3_MODE    0x00000007U
#define SPI_MEM_S_DIN3_MODE_M  (SPI_MEM_S_DIN3_MODE_V << SPI_MEM_S_DIN3_MODE_S)
#define SPI_MEM_S_DIN3_MODE_V  0x00000007U
#define SPI_MEM_S_DIN3_MODE_S  9
/** SPI_MEM_S_DIN4_MODE : R/W; bitpos: [14:12]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
 *  with the spi_clk
 */
#define SPI_MEM_S_DIN4_MODE    0x00000007U
#define SPI_MEM_S_DIN4_MODE_M  (SPI_MEM_S_DIN4_MODE_V << SPI_MEM_S_DIN4_MODE_S)
#define SPI_MEM_S_DIN4_MODE_V  0x00000007U
#define SPI_MEM_S_DIN4_MODE_S  12
/** SPI_MEM_S_DIN5_MODE : R/W; bitpos: [17:15]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
 *  with the spi_clk
 */
#define SPI_MEM_S_DIN5_MODE    0x00000007U
#define SPI_MEM_S_DIN5_MODE_M  (SPI_MEM_S_DIN5_MODE_V << SPI_MEM_S_DIN5_MODE_S)
#define SPI_MEM_S_DIN5_MODE_V  0x00000007U
#define SPI_MEM_S_DIN5_MODE_S  15
/** SPI_MEM_S_DIN6_MODE : R/W; bitpos: [20:18]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
 *  with the spi_clk
 */
#define SPI_MEM_S_DIN6_MODE    0x00000007U
#define SPI_MEM_S_DIN6_MODE_M  (SPI_MEM_S_DIN6_MODE_V << SPI_MEM_S_DIN6_MODE_S)
#define SPI_MEM_S_DIN6_MODE_V  0x00000007U
#define SPI_MEM_S_DIN6_MODE_S  18
/** SPI_MEM_S_DIN7_MODE : R/W; bitpos: [23:21]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
 *  with the spi_clk
 */
#define SPI_MEM_S_DIN7_MODE    0x00000007U
#define SPI_MEM_S_DIN7_MODE_M  (SPI_MEM_S_DIN7_MODE_V << SPI_MEM_S_DIN7_MODE_S)
#define SPI_MEM_S_DIN7_MODE_V  0x00000007U
#define SPI_MEM_S_DIN7_MODE_S  21
/** SPI_MEM_S_DINS_MODE : R/W; bitpos: [26:24]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: input without delayed, 1:
 *  input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
 *  with the spi_clk
 */
#define SPI_MEM_S_DINS_MODE    0x00000007U
#define SPI_MEM_S_DINS_MODE_M  (SPI_MEM_S_DINS_MODE_V << SPI_MEM_S_DINS_MODE_S)
#define SPI_MEM_S_DINS_MODE_V  0x00000007U
#define SPI_MEM_S_DINS_MODE_S  24

/** SPI_MEM_S_DIN_NUM_REG register
 *  MSPI flash input timing delay number control register
 */
#define SPI_MEM_S_DIN_NUM_REG (DR_REG_PSRAM_MSPI0_BASE + 0x188)
/** SPI_MEM_S_DIN0_NUM : R/W; bitpos: [1:0]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_MEM_S_DIN0_NUM    0x00000003U
#define SPI_MEM_S_DIN0_NUM_M  (SPI_MEM_S_DIN0_NUM_V << SPI_MEM_S_DIN0_NUM_S)
#define SPI_MEM_S_DIN0_NUM_V  0x00000003U
#define SPI_MEM_S_DIN0_NUM_S  0
/** SPI_MEM_S_DIN1_NUM : R/W; bitpos: [3:2]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_MEM_S_DIN1_NUM    0x00000003U
#define SPI_MEM_S_DIN1_NUM_M  (SPI_MEM_S_DIN1_NUM_V << SPI_MEM_S_DIN1_NUM_S)
#define SPI_MEM_S_DIN1_NUM_V  0x00000003U
#define SPI_MEM_S_DIN1_NUM_S  2
/** SPI_MEM_S_DIN2_NUM : R/W; bitpos: [5:4]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_MEM_S_DIN2_NUM    0x00000003U
#define SPI_MEM_S_DIN2_NUM_M  (SPI_MEM_S_DIN2_NUM_V << SPI_MEM_S_DIN2_NUM_S)
#define SPI_MEM_S_DIN2_NUM_V  0x00000003U
#define SPI_MEM_S_DIN2_NUM_S  4
/** SPI_MEM_S_DIN3_NUM : R/W; bitpos: [7:6]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_MEM_S_DIN3_NUM    0x00000003U
#define SPI_MEM_S_DIN3_NUM_M  (SPI_MEM_S_DIN3_NUM_V << SPI_MEM_S_DIN3_NUM_S)
#define SPI_MEM_S_DIN3_NUM_V  0x00000003U
#define SPI_MEM_S_DIN3_NUM_S  6
/** SPI_MEM_S_DIN4_NUM : R/W; bitpos: [9:8]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_MEM_S_DIN4_NUM    0x00000003U
#define SPI_MEM_S_DIN4_NUM_M  (SPI_MEM_S_DIN4_NUM_V << SPI_MEM_S_DIN4_NUM_S)
#define SPI_MEM_S_DIN4_NUM_V  0x00000003U
#define SPI_MEM_S_DIN4_NUM_S  8
/** SPI_MEM_S_DIN5_NUM : R/W; bitpos: [11:10]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_MEM_S_DIN5_NUM    0x00000003U
#define SPI_MEM_S_DIN5_NUM_M  (SPI_MEM_S_DIN5_NUM_V << SPI_MEM_S_DIN5_NUM_S)
#define SPI_MEM_S_DIN5_NUM_V  0x00000003U
#define SPI_MEM_S_DIN5_NUM_S  10
/** SPI_MEM_S_DIN6_NUM : R/W; bitpos: [13:12]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_MEM_S_DIN6_NUM    0x00000003U
#define SPI_MEM_S_DIN6_NUM_M  (SPI_MEM_S_DIN6_NUM_V << SPI_MEM_S_DIN6_NUM_S)
#define SPI_MEM_S_DIN6_NUM_V  0x00000003U
#define SPI_MEM_S_DIN6_NUM_S  12
/** SPI_MEM_S_DIN7_NUM : R/W; bitpos: [15:14]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_MEM_S_DIN7_NUM    0x00000003U
#define SPI_MEM_S_DIN7_NUM_M  (SPI_MEM_S_DIN7_NUM_V << SPI_MEM_S_DIN7_NUM_S)
#define SPI_MEM_S_DIN7_NUM_V  0x00000003U
#define SPI_MEM_S_DIN7_NUM_S  14
/** SPI_MEM_S_DINS_NUM : R/W; bitpos: [17:16]; default: 0;
 *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
 *  delayed by 2 cycles,...
 */
#define SPI_MEM_S_DINS_NUM    0x00000003U
#define SPI_MEM_S_DINS_NUM_M  (SPI_MEM_S_DINS_NUM_V << SPI_MEM_S_DINS_NUM_S)
#define SPI_MEM_S_DINS_NUM_V  0x00000003U
#define SPI_MEM_S_DINS_NUM_S  16

/** SPI_MEM_S_DOUT_MODE_REG register
 *  MSPI flash output timing adjustment control register
 */
#define SPI_MEM_S_DOUT_MODE_REG (DR_REG_PSRAM_MSPI0_BASE + 0x18c)
/** SPI_MEM_S_DOUT0_MODE : R/W; bitpos: [0]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_MEM_S_DOUT0_MODE    (BIT(0))
#define SPI_MEM_S_DOUT0_MODE_M  (SPI_MEM_S_DOUT0_MODE_V << SPI_MEM_S_DOUT0_MODE_S)
#define SPI_MEM_S_DOUT0_MODE_V  0x00000001U
#define SPI_MEM_S_DOUT0_MODE_S  0
/** SPI_MEM_S_DOUT1_MODE : R/W; bitpos: [1]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_MEM_S_DOUT1_MODE    (BIT(1))
#define SPI_MEM_S_DOUT1_MODE_M  (SPI_MEM_S_DOUT1_MODE_V << SPI_MEM_S_DOUT1_MODE_S)
#define SPI_MEM_S_DOUT1_MODE_V  0x00000001U
#define SPI_MEM_S_DOUT1_MODE_S  1
/** SPI_MEM_S_DOUT2_MODE : R/W; bitpos: [2]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_MEM_S_DOUT2_MODE    (BIT(2))
#define SPI_MEM_S_DOUT2_MODE_M  (SPI_MEM_S_DOUT2_MODE_V << SPI_MEM_S_DOUT2_MODE_S)
#define SPI_MEM_S_DOUT2_MODE_V  0x00000001U
#define SPI_MEM_S_DOUT2_MODE_S  2
/** SPI_MEM_S_DOUT3_MODE : R/W; bitpos: [3]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
 *  with the spi_clk high edge ,6: output with the spi_clk low edge
 */
#define SPI_MEM_S_DOUT3_MODE    (BIT(3))
#define SPI_MEM_S_DOUT3_MODE_M  (SPI_MEM_S_DOUT3_MODE_V << SPI_MEM_S_DOUT3_MODE_S)
#define SPI_MEM_S_DOUT3_MODE_V  0x00000001U
#define SPI_MEM_S_DOUT3_MODE_S  3
/** SPI_MEM_S_DOUT4_MODE : R/W; bitpos: [4]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the spi_clk
 */
#define SPI_MEM_S_DOUT4_MODE    (BIT(4))
#define SPI_MEM_S_DOUT4_MODE_M  (SPI_MEM_S_DOUT4_MODE_V << SPI_MEM_S_DOUT4_MODE_S)
#define SPI_MEM_S_DOUT4_MODE_V  0x00000001U
#define SPI_MEM_S_DOUT4_MODE_S  4
/** SPI_MEM_S_DOUT5_MODE : R/W; bitpos: [5]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the spi_clk
 */
#define SPI_MEM_S_DOUT5_MODE    (BIT(5))
#define SPI_MEM_S_DOUT5_MODE_M  (SPI_MEM_S_DOUT5_MODE_V << SPI_MEM_S_DOUT5_MODE_S)
#define SPI_MEM_S_DOUT5_MODE_V  0x00000001U
#define SPI_MEM_S_DOUT5_MODE_S  5
/** SPI_MEM_S_DOUT6_MODE : R/W; bitpos: [6]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the spi_clk
 */
#define SPI_MEM_S_DOUT6_MODE    (BIT(6))
#define SPI_MEM_S_DOUT6_MODE_M  (SPI_MEM_S_DOUT6_MODE_V << SPI_MEM_S_DOUT6_MODE_S)
#define SPI_MEM_S_DOUT6_MODE_V  0x00000001U
#define SPI_MEM_S_DOUT6_MODE_S  6
/** SPI_MEM_S_DOUT7_MODE : R/W; bitpos: [7]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the spi_clk
 */
#define SPI_MEM_S_DOUT7_MODE    (BIT(7))
#define SPI_MEM_S_DOUT7_MODE_M  (SPI_MEM_S_DOUT7_MODE_V << SPI_MEM_S_DOUT7_MODE_S)
#define SPI_MEM_S_DOUT7_MODE_V  0x00000001U
#define SPI_MEM_S_DOUT7_MODE_S  7
/** SPI_MEM_S_DOUTS_MODE : R/W; bitpos: [8]; default: 0;
 *  the output signals are delayed by system clock cycles, 0: output without delayed,
 *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 *  output with the spi_clk
 */
#define SPI_MEM_S_DOUTS_MODE    (BIT(8))
#define SPI_MEM_S_DOUTS_MODE_M  (SPI_MEM_S_DOUTS_MODE_V << SPI_MEM_S_DOUTS_MODE_S)
#define SPI_MEM_S_DOUTS_MODE_V  0x00000001U
#define SPI_MEM_S_DOUTS_MODE_S  8

