espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/spi_mem_s_reg.h
/** SPI_MEM_S_XTS_RELEASE_REG register
 *  Manual Encryption physical address register
 */
#define SPI_MEM_S_XTS_RELEASE_REG (DR_REG_PSRAM_MSPI0_BASE + 0x350)
/** SPI_MEM_S_XTS_RELEASE : WT; bitpos: [0]; default: 0;
 *  Set this bit to release encrypted result to mspi. This action should only be
 *  asserted when manual encryption status is 2. After this action, manual encryption
 *  status will become 3.
 */
#define SPI_MEM_S_XTS_RELEASE    (BIT(0))
#define SPI_MEM_S_XTS_RELEASE_M  (SPI_MEM_S_XTS_RELEASE_V << SPI_MEM_S_XTS_RELEASE_S)
#define SPI_MEM_S_XTS_RELEASE_V  0x00000001U
#define SPI_MEM_S_XTS_RELEASE_S  0

/** SPI_MEM_S_XTS_DESTROY_REG register
 *  Manual Encryption physical address register
 */
#define SPI_MEM_S_XTS_DESTROY_REG (DR_REG_PSRAM_MSPI0_BASE + 0x354)
/** SPI_MEM_S_XTS_DESTROY : WT; bitpos: [0]; default: 0;
 *  Set this bit to destroy encrypted result. This action should be asserted only when
 *  manual encryption status is 3. After this action, manual encryption status will
 *  become 0.
 */
#define SPI_MEM_S_XTS_DESTROY    (BIT(0))
#define SPI_MEM_S_XTS_DESTROY_M  (SPI_MEM_S_XTS_DESTROY_V << SPI_MEM_S_XTS_DESTROY_S)
#define SPI_MEM_S_XTS_DESTROY_V  0x00000001U
#define SPI_MEM_S_XTS_DESTROY_S  0

/** SPI_MEM_S_XTS_STATE_REG register
 *  Manual Encryption physical address register
 */
#define SPI_MEM_S_XTS_STATE_REG (DR_REG_PSRAM_MSPI0_BASE + 0x358)
/** SPI_MEM_S_XTS_STATE : RO; bitpos: [1:0]; default: 0;
 *  This bits stores the status of manual encryption. 0: idle, 1: busy of encryption
 *  calculation, 2: encryption calculation is done but the encrypted result is
 *  invisible to mspi, 3: the encrypted result is visible to mspi.
 */
#define SPI_MEM_S_XTS_STATE    0x00000003U
#define SPI_MEM_S_XTS_STATE_M  (SPI_MEM_S_XTS_STATE_V << SPI_MEM_S_XTS_STATE_S)
#define SPI_MEM_S_XTS_STATE_V  0x00000003U
#define SPI_MEM_S_XTS_STATE_S  0

/** SPI_MEM_S_XTS_DATE_REG register
 *  Manual Encryption version register
 */
#define SPI_MEM_S_XTS_DATE_REG (DR_REG_PSRAM_MSPI0_BASE + 0x35c)
/** SPI_MEM_S_XTS_DATE : R/W; bitpos: [29:0]; default: 539035911;
 *  This bits stores the last modified-time of manual encryption feature.
 */
#define SPI_MEM_S_XTS_DATE    0x3FFFFFFFU
#define SPI_MEM_S_XTS_DATE_M  (SPI_MEM_S_XTS_DATE_V << SPI_MEM_S_XTS_DATE_S)
#define SPI_MEM_S_XTS_DATE_V  0x3FFFFFFFU
#define SPI_MEM_S_XTS_DATE_S  0

/** SPI_MEM_S_MMU_ITEM_CONTENT_REG register
 *  MSPI-MMU item content register
 */
#define SPI_MEM_S_MMU_ITEM_CONTENT_REG (DR_REG_PSRAM_MSPI0_BASE + 0x37c)
/** SPI_MEM_S_MMU_ITEM_CONTENT : R/W; bitpos: [31:0]; default: 892;
 *  MSPI-MMU item content
 */
#define SPI_MEM_S_MMU_ITEM_CONTENT    0xFFFFFFFFU
#define SPI_MEM_S_MMU_ITEM_CONTENT_M  (SPI_MEM_S_MMU_ITEM_CONTENT_V << SPI_MEM_S_MMU_ITEM_CONTENT_S)
#define SPI_MEM_S_MMU_ITEM_CONTENT_V  0xFFFFFFFFU
#define SPI_MEM_S_MMU_ITEM_CONTENT_S  0

/** SPI_MEM_S_MMU_ITEM_INDEX_REG register
 *  MSPI-MMU item index register
 */
#define SPI_MEM_S_MMU_ITEM_INDEX_REG (DR_REG_PSRAM_MSPI0_BASE + 0x380)
/** SPI_MEM_S_MMU_ITEM_INDEX : R/W; bitpos: [31:0]; default: 0;
 *  MSPI-MMU item index
 */
#define SPI_MEM_S_MMU_ITEM_INDEX    0xFFFFFFFFU
#define SPI_MEM_S_MMU_ITEM_INDEX_M  (SPI_MEM_S_MMU_ITEM_INDEX_V << SPI_MEM_S_MMU_ITEM_INDEX_S)
#define SPI_MEM_S_MMU_ITEM_INDEX_V  0xFFFFFFFFU
#define SPI_MEM_S_MMU_ITEM_INDEX_S  0

/** SPI_MEM_S_MMU_POWER_CTRL_REG register
 *  MSPI MMU power control register
 */
#define SPI_MEM_S_MMU_POWER_CTRL_REG (DR_REG_PSRAM_MSPI0_BASE + 0x384)
/** SPI_MEM_S_MMU_MEM_FORCE_ON : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable mmu-memory clock force on
 */
#define SPI_MEM_S_MMU_MEM_FORCE_ON    (BIT(0))
#define SPI_MEM_S_MMU_MEM_FORCE_ON_M  (SPI_MEM_S_MMU_MEM_FORCE_ON_V << SPI_MEM_S_MMU_MEM_FORCE_ON_S)
#define SPI_MEM_S_MMU_MEM_FORCE_ON_V  0x00000001U
#define SPI_MEM_S_MMU_MEM_FORCE_ON_S  0
/** SPI_MEM_S_MMU_MEM_FORCE_PD : R/W; bitpos: [1]; default: 0;
 *  Set this bit to force mmu-memory powerdown
 */
#define SPI_MEM_S_MMU_MEM_FORCE_PD    (BIT(1))
#define SPI_MEM_S_MMU_MEM_FORCE_PD_M  (SPI_MEM_S_MMU_MEM_FORCE_PD_V << SPI_MEM_S_MMU_MEM_FORCE_PD_S)
#define SPI_MEM_S_MMU_MEM_FORCE_PD_V  0x00000001U
#define SPI_MEM_S_MMU_MEM_FORCE_PD_S  1
/** SPI_MEM_S_MMU_MEM_FORCE_PU : R/W; bitpos: [2]; default: 1;
 *  Set this bit to force mmu-memory powerup, in this case, the power should also be
 *  controlled by rtc.
 */
#define SPI_MEM_S_MMU_MEM_FORCE_PU    (BIT(2))
#define SPI_MEM_S_MMU_MEM_FORCE_PU_M  (SPI_MEM_S_MMU_MEM_FORCE_PU_V << SPI_MEM_S_MMU_MEM_FORCE_PU_S)
#define SPI_MEM_S_MMU_MEM_FORCE_PU_V  0x00000001U
#define SPI_MEM_S_MMU_MEM_FORCE_PU_S  2
/** SPI_MEM_S_MMU_PAGE_SIZE : R/W; bitpos: [4:3]; default: 0;
 *  0: Max page size , 1: Max page size/2 , 2: Max page size/4, 3: Max page size/8
 */
#define SPI_MEM_S_MMU_PAGE_SIZE    0x00000003U
#define SPI_MEM_S_MMU_PAGE_SIZE_M  (SPI_MEM_S_MMU_PAGE_SIZE_V << SPI_MEM_S_MMU_PAGE_SIZE_S)
#define SPI_MEM_S_MMU_PAGE_SIZE_V  0x00000003U
#define SPI_MEM_S_MMU_PAGE_SIZE_S  3
/** SPI_MEM_S_AUX_CTRL : R/W; bitpos: [29:16]; default: 4896;
 *  MMU PSRAM aux control register
 */
#define SPI_MEM_S_AUX_CTRL    0x00003FFFU
#define SPI_MEM_S_AUX_CTRL_M  (SPI_MEM_S_AUX_CTRL_V << SPI_MEM_S_AUX_CTRL_S)
#define SPI_MEM_S_AUX_CTRL_V  0x00003FFFU
#define SPI_MEM_S_AUX_CTRL_S  16
/** SPI_MEM_S_RDN_ENA : R/W; bitpos: [30]; default: 0;
 *  ECO register enable bit
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_RDN_ENA    (BIT(30))
#define SPI_MEM_S_RDN_ENA_M  (SPI_MEM_S_RDN_ENA_V << SPI_MEM_S_RDN_ENA_S)
#define SPI_MEM_S_RDN_ENA_V  0x00000001U
#define SPI_MEM_S_RDN_ENA_S  30
/** SPI_MEM_S_RDN_RESULT : RO; bitpos: [31]; default: 0;
 *  MSPI module clock domain and AXI clock domain ECO register result register
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI_MEM_S_RDN_RESULT    (BIT(31))
#define SPI_MEM_S_RDN_RESULT_M  (SPI_MEM_S_RDN_RESULT_V << SPI_MEM_S_RDN_RESULT_S)
#define SPI_MEM_S_RDN_RESULT_V  0x00000001U
#define SPI_MEM_S_RDN_RESULT_S  31

